{
    "reviews_count": 425,
    "reviews": [
        {
            "title": "",
            "body": "I love this stuff!",
            "rating": "5",
            "reviewer": "Shawna Churchill"
        },
        {
            "title": "",
            "body": "It’s amazing",
            "rating": "4",
            "reviewer": "Tania Patterson"
        },
        {
            "title": "",
            "body": "So far so good . Still in trial stage",
            "rating": "5",
            "reviewer": "Francis Alvir"
        },
        {
            "title": "",
            "body": "So far so good",
            "rating": "5",
            "reviewer": "G.P."
        },
        {
            "title": "Game-Changer With a Pleasant Scent",
            "body": "I absolutely love this product! I’ve been using it before my workouts, and it’s been a total game-changer. One of my favorite things about it is that it doesn’t smell like medicine—it has such a pleasant scent! I recently let my business partner use it on her knee that’s been giving her trouble, and she loved it just as much as I do. It’s effective, and enjoyable to use. I’ve even been sharing it on my social media because I believe in it so much. Great job, 27:17 team—thank you for creating such an amazing product!",
            "rating": "5",
            "reviewer": "Melvaree Witherspoon"
        },
        {
            "title": "",
            "body": "I love this stuff!",
            "rating": "5",
            "reviewer": "Shawna Churchill"
        },
        {
            "title": "",
            "body": "It’s amazing",
            "rating": "4",
            "reviewer": "Tania Patterson"
        },
        {
            "title": "",
            "body": "So far so good . Still in trial stage",
            "rating": "5",
            "reviewer": "Francis Alvir"
        },
        {
            "title": "",
            "body": "So far so good",
            "rating": "5",
            "reviewer": "G.P."
        },
        {
            "title": "Game-Changer With a Pleasant Scent",
            "body": "I absolutely love this product! I’ve been using it before my workouts, and it’s been a total game-changer. One of my favorite things about it is that it doesn’t smell like medicine—it has such a pleasant scent! I recently let my business partner use it on her knee that’s been giving her trouble, and she loved it just as much as I do. It’s effective, and enjoyable to use. I’ve even been sharing it on my social media because I believe in it so much. Great job, 27:17 team—thank you for creating such an amazing product!",
            "rating": "5",
            "reviewer": "Melvaree Witherspoon"
        },
        {
            "title": "PAIN GONE !!!",
            "body": "I've been using 27/17 for a month and this is my go to for pain free workouts and daily work.the smell is  subtle and once you rub it in your skin within minutes I can feel the joint pain subside.im on a reoccurring order and I absolutely 💯 percent recommend this to anyone needing relief.ill never be without this.it has saved my joints.",
            "rating": "5",
            "reviewer": "George Hardin"
        },
        {
            "title": "",
            "body": "This product is amazing. It does exactly what it says it does. I don't go a day without using it. I really feel a difference.",
            "rating": "5",
            "reviewer": "Marc Agnello"
        },
        {
            "title": "Good stuff!",
            "body": "Definitely improved my knee, I tore my MCL but now I'm back at it on the mats",
            "rating": "5",
            "reviewer": "Warren"
        },
        {
            "title": "No notice",
            "body": "Haven’t noticed anything different",
            "rating": "2",
            "reviewer": "Dallas Huber"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Brittany Miller"
        },
        {
            "title": "Great stuff here",
            "body": "My pain does go away much faster",
            "rating": "5",
            "reviewer": "Joe Flores"
        },
        {
            "title": "Significant Difference",
            "body": "I've been using it twice a day for less than a week and I'm running again without my knee throbbing afterwards.",
            "rating": "5",
            "reviewer": "P.Q."
        },
        {
            "title": "100% LEGIT",
            "body": "After tearing bicep tendon upper and lower last Dec, and months of PT. Finally started back on the path. 2717 has been a key part in helping get through the lingering aches and pains associated with my injury! Also has been huge for all the new aches and pains with my new training regime!",
            "rating": "5",
            "reviewer": "Cory Chase"
        },
        {
            "title": "",
            "body": "Very expensive and does not work as well as claimed",
            "rating": "2",
            "reviewer": "Shaffer Day"
        },
        {
            "title": "Miraculous!",
            "body": "I’ve tried many treatments for my diabetic neuropathy. This is the only one that has offered significant and consistent relief! I’m a happy camper!",
            "rating": "5",
            "reviewer": "Lee Endsley"
        },
        {
            "title": "Christmas present",
            "body": "Can’t rate Christmas present",
            "rating": "5",
            "reviewer": "Sean Skender"
        },
        {
            "title": "I think it's good!",
            "body": "Small labrum tear in left shoulder that has bothered me for years. 6 days in on 27:17 and the pain is gone. Very weird experience, I'm not sure if it's a placebo effect or actually working lol",
            "rating": "5",
            "reviewer": "Shawn Miller"
        },
        {
            "title": "27:17",
            "body": "Best recovery cream out there",
            "rating": "5",
            "reviewer": "Kaden Cassidy"
        },
        {
            "title": "It works!",
            "body": "After spending hundreds of dollars on other products I decided to give this product a shot.  Guess what this is the product that worked as described. Thank you from a cheerleader dad and someone with Army knees.",
            "rating": "5",
            "reviewer": "Andrew Sa-onoy"
        },
        {
            "title": "Game Changer",
            "body": "40 yrs of wrestling/coaching my body is beat up.  Within 3 days of using 27:17 my shoulders and knees are in way less pain! Game Changer",
            "rating": "5",
            "reviewer": "David Strack"
        },
        {
            "title": "Phenomenal",
            "body": "Just started to use this product. Works well and quickly. No absurd aroma or feel. Highly recommended. I've tried other products, this is my new favorite.",
            "rating": "5",
            "reviewer": "Mike"
        },
        {
            "title": "Great Product",
            "body": "I use this product, alongside PT, for a shoulder issue and have found it to be very successful. Will continue to use product and recommend it for everyone else.",
            "rating": "5",
            "reviewer": "James"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Stuart Bundy"
        },
        {
            "title": "Great customer service",
            "body": "Just started using the product and so far it seems great.  I’m excited to see what the results are after using it for a while.  The thing I was most impressed with is the customer service.  My first order didn’t get delivered.  Just a quick email and about a day later they sent a replacement.  If the product is half as good as the customer service I’ll be a return customer for sure!",
            "rating": "5",
            "reviewer": "Mike P."
        },
        {
            "title": "Product Is Magic",
            "body": "I was recovering from an Acl reconstruction with partial tears in my mcl, meniscus, and other ligaments in the knee. Did PT for over a year and still wasn’t getting better, while spraining my mcl twice after the 1 year mark. I used 27:17 for 1 week twice a day and my knee feels better than ever.",
            "rating": "5",
            "reviewer": "Grayson Flugaur"
        },
        {
            "title": "27:17",
            "body": "Much needed relief from knee pain that I have been suffering from for the past 6 months +",
            "rating": "5",
            "reviewer": "Isaiah Jimenez"
        },
        {
            "title": "Hasn’t worked yet",
            "body": "My knee and bicep still hurts.",
            "rating": "2",
            "reviewer": "christopher castaneda"
        },
        {
            "title": "",
            "body": "It dose the trick I use it twice a day morning and evening it took a few days to start to work but i diffenly need another one and I will pay it it this time",
            "rating": "5",
            "reviewer": "Cyril Rennels"
        },
        {
            "title": "Amazing",
            "body": "Had very little movement in my shoulder and within a week have normal motion back!",
            "rating": "5",
            "reviewer": "Jacob Sanders"
        },
        {
            "title": "Awesome",
            "body": "Bo if this is really you I got the can yesterday and tried it out today. Holy shit man i can't believe how well this worked! I went the entire day without pain and the very little pain i did have was so miniscule I wish I had this stuff 7 years ago. Thank you thank you thank you. PS I'M talking for every former  and current USA wrestler when I say Go fucking SMASH Khamzat!!",
            "rating": "5",
            "reviewer": "Kip Anderson"
        },
        {
            "title": "So far no releif",
            "body": "So far no relief at all",
            "rating": "1",
            "reviewer": "Michael Wishnia"
        },
        {
            "title": "This is my review My name is James heavner",
            "body": "So far it's not doing nothing for me and I've been using it daily rubbing it in real good on my knees nothing yet.",
            "rating": "5",
            "reviewer": "James Heavner"
        },
        {
            "title": "First time user",
            "body": "Loved the product. Ease of use . It also pentrates skin easily. Is not oily. Would like to see more facts on how it heals tendons and ligaments as opposed to just thinking it works or hoping. I'll get through my first bottle and see what the results are.",
            "rating": "5",
            "reviewer": "Joey Araujo"
        },
        {
            "title": "",
            "body": "Love this stuff!",
            "rating": "5",
            "reviewer": "Michael McKee"
        },
        {
            "title": "Great product",
            "body": "My sons use 27:17 for the aches and tweaks that go along with HS and youth football and wrestling. It makes a difference.",
            "rating": "5",
            "reviewer": "Neil C."
        },
        {
            "title": "Not sure and expensive",
            "body": "Used a few times, haven’t felt any improvement of aching muscles and joints. Maybe expecting too much right away",
            "rating": "2",
            "reviewer": "Shane Emery"
        },
        {
            "title": "Works great",
            "body": "Product works great , I get some acute relief from the pain within minutes and it helps with my old nagging injuries so I can get back to training",
            "rating": "5",
            "reviewer": "Kevin Burke"
        },
        {
            "title": "Big relief!",
            "body": "Dear 27:17 team,Just want to express my gratitude and convey the relief I have experienced whilst using your product!The almanac doesn’t forgive and Father Time is undefeated, but your product truly helps with joint pain.I just wish your product was available at a reduced price/discounts for  loyal customers like myself!Hope to continue enjoying your fine product.Sincerely,Ares Infante",
            "rating": "5",
            "reviewer": "Ares Infante"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "David Folk"
        },
        {
            "title": "Feeling Amazing",
            "body": "27:17 wow!! Been using it about a week now and I feel great!! Definitely a game changer of my recovery time!!",
            "rating": "5",
            "reviewer": "Jonathan Shomo"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Steve Guntrum"
        },
        {
            "title": "Love it so far!",
            "body": "It has definitely made a difference in the best subtle way, love that it does not have that cooling and burning sensation.  Feels good going on, not greasy and just so easy to use.  My shoulders, forearms and elbows have been hurting and this has definitely help them get back to normal in just a week.",
            "rating": "5",
            "reviewer": "Customer"
        },
        {
            "title": "👍🏽👍🏽",
            "body": "I’m a physiotherapist with 20 years of experience, and I discovered this product through a friend. I initially ordered two for myself and applied it to my rhomboid and trapezius muscles. I love the subtle scent and cooling effect, and I felt relief within minutes of application. I quickly ordered more to use on my clients, who are world champion boxers and NBA athletes. I’m impressed by its workability and how smoothly it glides on the skin. Thank you for making a great product that doesn’t break the bank.",
            "rating": "5",
            "reviewer": "Vanessa Lockwood"
        },
        {
            "title": "Bo Knows",
            "body": "Helps my old ass recover to stay on the grind",
            "rating": "5",
            "reviewer": "Mike Alterio"
        },
        {
            "title": "27:17",
            "body": "Works great for muscle aches and pains! Isn’t messy, smelly, or greasy!",
            "rating": "5",
            "reviewer": "Mark Newsome II"
        },
        {
            "title": "Great product",
            "body": "I love this stuff idk how it works but it’s the best in the market!!",
            "rating": "5",
            "reviewer": "Jacob MacDonald"
        },
        {
            "title": "It Works!",
            "body": "I am a 59-year-old age group triathlete.  I have had 2 meniscus surgeries in the past two years.  I was training for my 70.3 1/2 Ironman event when I felt similar knee pain to the previous tears.  I decided to try this product.  It wasn't immediate but after using 2/day for 4 days I could feel the difference.  After 10 days of daily use it felt 90% better! I completed the race and continue to use it daily!  I am now a believer in this!  It works!",
            "rating": "5",
            "reviewer": "Kyle Kilmer"
        },
        {
            "title": "Excellent Item, recommending to everyone",
            "body": "My son had a calf injury this year in football, we purchased 27:17 because nothing was really working.  15 minutes after applying 27:17 the pain subsided, and he got his mobility back.  He applied 27:17 before his game this weekend and it got him thru the game with no problems.  He is going to use it on a regular basis during this year's Westling season.  I have actually started using it as well for my minor aches and pains.  So far it is a great product, and we are strongly recommending it to friends, family and fellow athletes.",
            "rating": "5",
            "reviewer": "Don Wright"
        },
        {
            "title": "It doesn't work for me",
            "body": "It only gives temporary relief of my stroke symptoms on the right side ofmy body.",
            "rating": "5",
            "reviewer": "Steven Shevey"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Bo Nickal"
        },
        {
            "title": "Worked good",
            "body": "Working well when I need it. Continue use a must to get difference. Idk if it is a placebo affect or it works yet. Either way noticing slight differences.",
            "rating": "4",
            "reviewer": "Michael Mcafee"
        },
        {
            "title": "",
            "body": "This stuff works! I've tried alot of different supplements and this seems to heal not just mask issues. I highly recommend trying if you are thinking about buying it!",
            "rating": "5",
            "reviewer": "Matthew Weyandt"
        },
        {
            "title": "Iron does sharpen iron",
            "body": "I'm a very active senior citizen!  I do a lot of very physical volunteer work and I also lift and workout consistently!  I heard about 27:17 on Jocko's podcast and tried it.  My shoulders and knees had been bothering me.  After using 27:17 my knees are much better and my shoulder pain is rare!  Anytime I have a minor injury I turn to 27:17 for prompt relief!",
            "rating": "5",
            "reviewer": "Chip Fagan"
        },
        {
            "title": "Hasn’t shipped",
            "body": "Hard to review a product that hasn’t shipped yet. It has been 10 days, I expected to have it also… that’s not the case.",
            "rating": "1",
            "reviewer": "Michael DeWitt"
        },
        {
            "title": "Over priced",
            "body": "Not working",
            "rating": "2",
            "reviewer": "Patrick McAllister"
        },
        {
            "title": "Young at heart but getting older",
            "body": "I've always been doing tough sports now I'm mainly sticking with jiu-jitsu Currently a brown belt and I was looking for something. I've had knee problems both acl replaced and this product has helped. Im actually blown away how well it helps.",
            "rating": "5",
            "reviewer": "Sean Harrington"
        },
        {
            "title": "Daily Driver",
            "body": "At this point in my life this recovery cream is a daily use cream. I lather this stuff all over every day after I step out of the shower, its my daily moisturizer. I am retired military of 21 years of service and I have put my body though a lot, this cream allows me to continue to do the tings I love. The cream is not a fix all but it really tries to be. I learned about h the cream through Jocko's podcast. I recommend this cream to everyone I cross paths with. The cream speaks for itself it works, maybe its a placebo but I don't care, plan and simple this shit works!Thank youMatt",
            "rating": "5",
            "reviewer": "Matthew Oconer"
        },
        {
            "title": "Very effective in reducing pain from inflammation",
            "body": "I am a body worker and use many alternative treatments. This product was recommended by my chiropractor friend and it really works. I have what feels like arthritic pain in my wrist and thumb and using the product regularly keeps it at bay! My husband also uses it for a chronic shoulder issue and it provides relief!",
            "rating": "5",
            "reviewer": "Cherise Katsaros"
        },
        {
            "title": "Good product",
            "body": "I have been using it for about a couple of weeks now. So far it has helped my recovery after pickleball. Will submit another review after using it for longer period.",
            "rating": "5",
            "reviewer": "Janie Ma"
        },
        {
            "title": "So far so good",
            "body": "Been using the product for about a week on a hamstring/glute issue that has been an ongoing issue for several months. I have noticed some small improvements and will continue to use to hopefully speed the last of the recovery process. Product smells nice. Hoping for great results with continued use.",
            "rating": "5",
            "reviewer": "Douglas Timmons"
        },
        {
            "title": "",
            "body": "Best customer service team and the best product on the market",
            "rating": "5",
            "reviewer": "Will Brown"
        },
        {
            "title": "I never got my order",
            "body": "I haven't recieved my order yet",
            "rating": "5",
            "reviewer": "Candace Urias"
        },
        {
            "title": "Treatment of joint calcifications (shoulder)",
            "body": "After 3 days of your treatment my discomfort has partially subsided! Hopefully it can continue!  It surely beats suggested surgery! So far!!",
            "rating": "5",
            "reviewer": "Thomas A Pasquinelly"
        },
        {
            "title": "Plantar Facitis sucks",
            "body": "The title says it all. This cream has been helping for sure. I put it on after the gym and before sleep. It is definitely helping!",
            "rating": "5",
            "reviewer": "Sam Axelrod"
        },
        {
            "title": "",
            "body": "Works better than anything else we’ve tried.",
            "rating": "5",
            "reviewer": "Monica Beltran"
        },
        {
            "title": "So far, so good",
            "body": "I've got a heal spur and , I'm applying it twice a day and it's noticeably less painful, hoping it kills it all together!",
            "rating": "5",
            "reviewer": "Henry Schlute"
        },
        {
            "title": "First time user",
            "body": "Hurt my shoulder and have been using this as part of my recovery.",
            "rating": "5",
            "reviewer": "Charles Parker"
        },
        {
            "title": "Amazing",
            "body": "Knees have been bad from almost 25 years of sports and crossfit couldn't be more happy. Wake up feeling great and a side note doesn't make the bed sheets smell at all like ice hot does will be a returning customer for sureThank You",
            "rating": "5",
            "reviewer": "Eric DeJanvier"
        },
        {
            "title": "",
            "body": "Greatest recover cream of all time",
            "rating": "5",
            "reviewer": "Will Brown"
        },
        {
            "title": "Shoulder pain",
            "body": "I have used this product for two weeks now and have seen great results, Less pain,more normal mobility now",
            "rating": "5",
            "reviewer": "Vaughn Glover"
        },
        {
            "title": "What Relief",
            "body": "I have done physical Therapy, ice, heat, red light, all seem to help on such a minor scale. I purchased 27:17 and within days my should felt 40-60% better. I lifting weights with out struggle or pain. What relief this cream is to have with my recovery regiment.",
            "rating": "5",
            "reviewer": "Cameron Saltus"
        },
        {
            "title": "",
            "body": "Good",
            "rating": "5",
            "reviewer": "Jonathan Alberto"
        },
        {
            "title": "",
            "body": "Amazing",
            "rating": "5",
            "reviewer": "Roderick crumedy"
        },
        {
            "title": "27:17",
            "body": "It's great...have noticed a big difference in the inflammation in my knee in the 2 weeks I have been using it!. usually I have pain and soreness after I get done playing basketball..but since I been using the cream barely any pain",
            "rating": "5",
            "reviewer": "Craig Clark"
        },
        {
            "title": "Good so far",
            "body": "I have only been using it for a few days, however it seems to be helping. I have been struggling with elbow joint and tendon pain for months and it is already somewhat better.",
            "rating": "5",
            "reviewer": "Rob Martin"
        },
        {
            "title": "Chiropractor Approved - Our Patients Love 27:17!",
            "body": "We just started using 27:17 relief & recovery cream on our patients and the feedback has been very positive! Our patients already love the way it makes them feel and they like the smell of it too! We just started stocking it at our front desk so patients can grab and go and use it for at home use, on the golf course, sports related, after a work-out or exercise, over their arthritis, tendinitis, bursitis and much more! The ingredients are top notch! Highly recommend.",
            "rating": "5",
            "reviewer": "Dr. Samuel Camarata"
        },
        {
            "title": "Just Over a Week In",
            "body": "I feel like I can't give a good review yet as I have only been using the product for just over a week.  I don't think that's enough time to feel the full affects of the product.",
            "rating": "2",
            "reviewer": "Liz Spartveit"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "4",
            "reviewer": "Michael Maresca"
        },
        {
            "title": "Doesn't work on my pain in back and hip",
            "body": "I purchased this product to help in rehabilitating a back and sciatic nerve injury.It really doesn't help this particular injury.",
            "rating": "3",
            "reviewer": "Lou fonda"
        },
        {
            "title": "Smells nice.",
            "body": "On day 4/5 post torn meniscus and MCL, I’m in  recovery - get back to working phase, with some swelling. I’ve not noticed any differences - it’s still early however.",
            "rating": "5",
            "reviewer": "Gabriel Maxwell"
        },
        {
            "title": "Overhyped",
            "body": "Doesn’t really do anything , just good marketing",
            "rating": "1",
            "reviewer": "Nawar Alkawadri"
        },
        {
            "title": "This product really helps",
            "body": "I believe that if you added a little cayenne pepper it would help speed up the healing process",
            "rating": "5",
            "reviewer": "Jeremy Wayble"
        },
        {
            "title": "Love this product",
            "body": "Ordered this for a sore bicep that turned into golfers elbow. After a few days of use my pump broke within the bottle. I emailed support and got a response almost immediately and they made it right. I’ve since been using for about a week and have seen a noticeable change on the pain scale. This isn’t a miracle cream, it won’t work overnight. But consistent application to your pain area it absolutely makes a difference . I’ve used multiple topical creams. This is the only one I’ll be using moving forward.",
            "rating": "5",
            "reviewer": "Lance Berg"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Jason Silva"
        },
        {
            "title": "",
            "body": "Great product. I've given it to several family members and training partners. All good results. It helps out my mom tremendously, who had a recent stroke and is over 70 years old. This product is a normal part of my recovery routine for MMA.",
            "rating": "5",
            "reviewer": "Daniel St.John"
        },
        {
            "title": "Surprised by Results",
            "body": "Both shoulders would feel a bit sore/irritated after working out nothing major.  I just wanted some relief in recovery and 24:17 did not disappoint.  I’m actually surprised at how good it works.  It’s now a part of my regular routine.  Thanks for a great product.",
            "rating": "5",
            "reviewer": "Pat Shannon"
        },
        {
            "title": "Cancel subscription",
            "body": "I would like to cancel my subscriptionAnd also need to return the product!",
            "rating": "5",
            "reviewer": "robert britton"
        },
        {
            "title": "This will be in my EDC for the rest of my life",
            "body": "Incredible product.  Very effective.  From the perfect dispensing bottle to a product that will make your old tired muscles better, you can’t go wrong.  For the same price as a doctors visit you can avoid a few.",
            "rating": "5",
            "reviewer": "Michael Gilbert"
        },
        {
            "title": "",
            "body": "It seems to be working. Over the last couple of weeks the pain has gone from a 7/8 to a 3/4. Pretty impressed.",
            "rating": "5",
            "reviewer": "Philip Damelia"
        },
        {
            "title": "Works great!!",
            "body": "Good stuff, helps with my aches and pains.",
            "rating": "5",
            "reviewer": "Duane Fay"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Katryna Farran"
        },
        {
            "title": "Great post recovery cream",
            "body": "Liked aroma very therapeutic helped release tension and soarness in muscle",
            "rating": "5",
            "reviewer": "Matt Regan"
        },
        {
            "title": "Life-Changing Relief for Back Pain!",
            "body": "I've been struggling with on and off low back pain pain for years, trying countless remedies with little success. That all changed when I discovered this incredible pain-relieving cream! From the first application, I felt a noticeable difference. The cream has a pleasant, non-greasy texture that absorbs quickly, and the relief it provides is almost instant.What truly sets this product apart is its long-lasting effect. I can go about my day without constantly being reminded of my back pain. It's been a game-changer for my daily routine, allowing me to move more freely and comfortably. I've even started to enjoy activities that I had given up on due to the pain.I highly recommend this pain-relieving cream to anyone dealing with pain. It's a fantastic, effective solution that has significantly improved my quality of life. Five stars all the way!",
            "rating": "5",
            "reviewer": "Jason Gearhart"
        },
        {
            "title": "Unsatisfied",
            "body": "Unfortunately the product was useless. A very expensive lotion. I was hesitant to buy it and decided to ignore the reviews of saying it didn’t do anything. I’ve used it for a week straight 2-3 times a day with no relief or feeling different/better.The pros are it doesn’t smell bad or leave any residue or greasiness.",
            "rating": "1",
            "reviewer": "Kaitlyn Putney"
        },
        {
            "title": "Been a long time",
            "body": "Had a bike accident a year and a half ago, this has helped me recover more in a week than anything else.",
            "rating": "5",
            "reviewer": "David Duba"
        },
        {
            "title": "I was blown away",
            "body": "The first day I was amazed. It seemed to work as it was described. But after a few applications it does not work the same for me . Still better than anything else I have tried . The smell by far is better and it doesn’t give me that cool or hot sensation like others.",
            "rating": "3",
            "reviewer": "Raymond Joyce"
        },
        {
            "title": "",
            "body": "this stuff work amazing.",
            "rating": "5",
            "reviewer": "Logan Sherman"
        },
        {
            "title": "To soon to tell ( hence 4 stars)",
            "body": "I have a split tendon in my ankle so it might take some time to really see a difference. My wife has been using it as well and seems to be helping her with her knees.",
            "rating": "4",
            "reviewer": "John Fragale"
        },
        {
            "title": "Relief At It’s Finest",
            "body": "This is the single best product I have used to help me recover.  I am an ex college football player and I have had two knee surgeries in my life.  I have been prescribed and recommended a lot of different creams to help relieve the pain and bring comfort.  This product is on a completely different level than all the rest of them.  I have been giving it to my wife as well and she is in love with it.  She works in retail and is on her feet all day long and after a long shift her feet and knees are swollen and in pain.  She loves this product and has seen the immediate results from the moment she first put it on.",
            "rating": "5",
            "reviewer": "Wesley Ashabranner"
        },
        {
            "title": "",
            "body": "Works great",
            "rating": "5",
            "reviewer": "Justin Bradshaw"
        },
        {
            "title": "Loving it so far!",
            "body": "My left knee and right shoulder have been aching for a few months. I applied the 27:17 cream, once a day, and within a few days my knee felt better. After that my shoulder still did not respond so I upped it to two applications a day, this has help my shoulder. I’m looking forward to a few more weeks to see where my aches are at.",
            "rating": "5",
            "reviewer": "Matthew Alldredge"
        },
        {
            "title": "2717",
            "body": "Greatness. Especially for us aging jiu-jitsu practitioners.",
            "rating": "5",
            "reviewer": "Gerald Aguiar"
        },
        {
            "title": "27:17 Recovery cream",
            "body": "Received my 27:17 a couple of weeks ago.  I have been dealing with some tendinitis in both elbows, along with some pain in my knees for awhile.  Both have been inhibiting my workouts too much lately. Applied the 27:17 to those areas and IT REALLY WORKED WELL.  I LOVE it!  It feels as if it is truly helping recovery and not just temporary pain relief.  Smells great and doesn't leave you feeling greasy.  For sure will continue using. Definitely recommend giving it a shot.",
            "rating": "5",
            "reviewer": "Mike Morton"
        },
        {
            "title": "Best recovery cream for athletes!",
            "body": "I’ve tried every CBD and cream possible. This stuff really works for multi day events & long days on the trail!",
            "rating": "5",
            "reviewer": "Kayla Howell"
        },
        {
            "title": "",
            "body": "Great stuff help knees and sore muscles in my neck",
            "rating": "5",
            "reviewer": "Billy Gathright"
        },
        {
            "title": "Ingredients",
            "body": "Water (Aqua), Cocos Nucifera (Coconut) Oil, Glycerin, Cetearyl Alcohol,Hydroxyethylcellulose, Polysorabte 60, Copper Tripeptide-1, ArnicaMontana (Arnica) Flower, Beta Caryophyllene, Limonene, Terpinoline,Delta-3 Carene, Terpineol, Geraniol, Alpha Bisabolol, Alcohol, MenthaSpicata (Spearmint) Essential Oil, Mentha Piperita (Peppermint) EssentialOil, Eucalyptus Globulus (Eucalyptus) Essential Oil, Rosmarinus Officinalis(Rosemary) Essential Oil, Junipers Communis (Juniper) Fruit Essential Oil,Pinus Sylvestris (Pine Scotch) Essential Oil, Zingiber Officinale (Ginger)Extract, Cupressus Sempervierens (Cypress) Essential Oil, OcimumBasilicum (Sweet Basil) Essential Oil, Melaleuca Leucadendron Cajaputi(Cajeput) Essential Oil, Citrus Paradisi (Pink Grapefruit) Essential Oil,Cymbopogon Winterianus (Citronella) Essential Oil, CinnamomumZeylanicum (Cinnamon) Leaf Essential Oil, Foeniculum Vulgare (Fennel)Essential Oil, Citrus Medica Limonum (Lemon) Essential Oil, LavandulaAngustifolia (Lavender) Essential Oil, Cymbopogon Flexuosus(Lemongrass) Essential Oil, Chamaemelum Nobile (Chamomile) EssentialOil, Origanum Vulgare (Oregano) Essential Oil, Helichrysum Italicum(Helichrysum) Essential Oil, Piper Nigrum (Black Pepper) Essential Oil,Chamomilla Recutita (Chamomile) Essential Oil, Tetrasodium GlutamateDiacetate, Caprylyl Glycol, Sorbic Acid, PhenoxyethanolAre you kidding me? Where is the trash can",
            "rating": "1",
            "reviewer": "William Anger"
        },
        {
            "title": "",
            "body": "It’s really great. Not only does it work, but it smells incredible.",
            "rating": "5",
            "reviewer": "Cameron Eller"
        },
        {
            "title": "Feels great!",
            "body": "I love this product. It goes on the skin real smooth and smell is also nice. You can feel pain relief within a couple of days.",
            "rating": "5",
            "reviewer": "Raul Rios"
        },
        {
            "title": "Seems to work",
            "body": "So far so good. I’ve used it several times on minor injuries and it’s worked well.",
            "rating": "5",
            "reviewer": "Michael B."
        },
        {
            "title": "Good Stuff",
            "body": "It’s early so I will not make a definitive conclusion on the effectiveness of the product, but I’m hopeful the formula you have can help with aches & pain management. I would highly recommend a roll on or stick type of application as squirting into hands tends to lose a small amount of product through absorption into palms with every application.",
            "rating": "4",
            "reviewer": "Jaime Espalin"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "GEOFFREY MOSEBACH"
        },
        {
            "title": "This works when?????",
            "body": "Use this religiously for 3 weeks on a sprained wrist. So far it’s had no affect!!!Is this just BS??",
            "rating": "1",
            "reviewer": "Chip Shearin"
        },
        {
            "title": "",
            "body": "ABSOLUTELY 💯 AMAZING",
            "rating": "5",
            "reviewer": "Roderick crumedy"
        },
        {
            "title": "Almost instant Improvement",
            "body": "Within 30 min. of putting this stuff on the muscles around my knee the ache disipated fast. Will definatly keep some on hand at all times.",
            "rating": "5",
            "reviewer": "Ryan Smart"
        },
        {
            "title": "It reduced my forearm pain",
            "body": "After using it definitely reduced my forearm pain and I was using ice packs as well..it really did helped.",
            "rating": "2",
            "reviewer": "Rajdeep Darbar"
        },
        {
            "title": "Hella good product",
            "body": "Thanks for a great product. I've had knee issues after falling threw a skylight. after four aplicacatons of the product my knee issues  subsided. I have recommended this product to everyone I know.",
            "rating": "5",
            "reviewer": "Matthew Parra"
        },
        {
            "title": "Smells good",
            "body": "Feels great, don't have enough",
            "rating": "5",
            "reviewer": "Alexander Taylor-Cardenas"
        },
        {
            "title": "4.5 Stars!",
            "body": "It’s a great product! I will look forward to using the product more often throughout my future. I do personally want more studies on the copper peptides. As of right I would say this is a good alternative to add to your routine from other brandsI only gave it a 4.5 bc people need to realize this isn’t going to fully cure you..you need add other things into your recovery. Red light therapy, cold exposure, acupuncture, etc",
            "rating": "4",
            "reviewer": "David McGowan"
        },
        {
            "title": "",
            "body": "Not sure how much it works but feels good as a lotion.",
            "rating": "3",
            "reviewer": "Maclane Matsuoka"
        },
        {
            "title": "",
            "body": "Amazing!!! Out of this world.",
            "rating": "5",
            "reviewer": "Manuk Lelikian"
        },
        {
            "title": "",
            "body": "I was a little skeptical about this product. What was it really going to do? Is it really going to help or is it a glorified bengay?Ok let me be clear, this stuff is a miracle cream. I had nagging injuries I’ve spend months trying to get rid of. I used this and felt better in two weeks. This has solved every injury issue. I cannot stress this enough this stuff actually really works. It’s amazing!!! Buy this now!",
            "rating": "5",
            "reviewer": "Benjamin Braasch III"
        },
        {
            "title": "",
            "body": "Amazing",
            "rating": "5",
            "reviewer": "Joseph Aceto"
        },
        {
            "title": "Better than expected",
            "body": "I put this in my knee that had a torn meniscus and it really helped. I was skeptical at first. I’m a big believer now.",
            "rating": "5",
            "reviewer": "My Home"
        },
        {
            "title": "",
            "body": "It’s been good it’s only been a week but I feel a little bit better",
            "rating": "4",
            "reviewer": "Robert Smid"
        },
        {
            "title": "",
            "body": "Felt great using this product. Works as advertised!",
            "rating": "5",
            "reviewer": "c."
        },
        {
            "title": "Relief",
            "body": "I recently had back surgery and have had sore muscles in my low back ever since. I had been trying traditional creams: icy hot, bio freeze with some relief. I was told about 27:17 from one of my wrestlers that’s now in college and she said this stuff was amazing. I trust her so I made the purchase. I have to say, this product has help relieve my muscle soreness better than either of the traditional products. I am a firm believer in this product now and it will become a staple in our wrestling room.",
            "rating": "5",
            "reviewer": "Jeremiah LaFountain"
        },
        {
            "title": "Starter Kit",
            "body": "It smells good thats about it. I didn't receive any relief.",
            "rating": "1",
            "reviewer": "Josh Zeller"
        },
        {
            "title": "Relief!",
            "body": "I have notice immediate relief from various injuries, some plaguing me for years. I can’t give a long term review at this time but so far I’m happy with the results. Thanks 27:17!",
            "rating": "5",
            "reviewer": "Jeremy D."
        },
        {
            "title": "27:17 Is Great!",
            "body": "First I’d like to say I love the smell. If something doesn’t smell great it’s a complete turn off for me. I’ve only used it for a few days but I do think I’m getting relief. I had a total knee replacement in March and need a second one in July. This is helping with the inflammation on both. Thank you!",
            "rating": "5",
            "reviewer": "Marian P Ellis"
        },
        {
            "title": "It works",
            "body": "This stuff is the best!!",
            "rating": "5",
            "reviewer": "Jordan Mohammadioun"
        },
        {
            "title": "Great product",
            "body": "This really works to give relief from aches and pains.",
            "rating": "5",
            "reviewer": "Paul Pound"
        },
        {
            "title": "Not sure if it is working yet.",
            "body": "I have only used it for 5 days.  I have not seen a difference in the aches and pains I have in a few different joints. I have been using it in the mornings and bed time each day.  I am hoping to see some changes in the next couple of days.  My current pain is in my right ankle, my middle finger knuckle joints on both hands and my right knee.",
            "rating": "4",
            "reviewer": "Charles Myers"
        },
        {
            "title": "Surprised",
            "body": "I’m always skeptical of stuff like this but I put some on my knees before doing the stair stepper. It wasn’t until I was finished that I realized my knees weren’t aching. Really good stuff. Smells great too",
            "rating": "5",
            "reviewer": "Grant Alexander"
        },
        {
            "title": "",
            "body": "Awesome product…. Smells great and eases muscle soreness!",
            "rating": "5",
            "reviewer": "Shawn Louie"
        },
        {
            "title": "",
            "body": "I love it. Healed up a pulled muscle within a week. Got me back out putting in long miles again.",
            "rating": "5",
            "reviewer": "Ryan Applewhite"
        },
        {
            "title": "How is it you ask?",
            "body": "That’s a great question. I don’t know it hasn’t arrived yet. I had the subscription, but cancelled it because of the shipping time. If the product works I may order again, but very unlikely.",
            "rating": "1",
            "reviewer": "Anthony Doriott"
        },
        {
            "title": "Not sure if its doing anything for my biceps tendonitis",
            "body": "Not sure if its doing anything for my biceps tendonitis",
            "rating": "2",
            "reviewer": "Kevin Ma"
        },
        {
            "title": "Works",
            "body": "My wife n I both like it.",
            "rating": "5",
            "reviewer": "Paul j Daniels"
        },
        {
            "title": "",
            "body": "I’m not sure if it actually works",
            "rating": "3",
            "reviewer": "Savas Konstadinidis"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "David Evers"
        },
        {
            "title": "It’s great",
            "body": "It’s great but can I stop paying for it",
            "rating": "5",
            "reviewer": "jeremy grijalva"
        },
        {
            "title": "amazing stuff!!!",
            "body": "man this almost seems like magic!! highly recommend to anyone with any muscle pain. just mind blowing.",
            "rating": "5",
            "reviewer": "Jonathan Coradin"
        },
        {
            "title": "Good stuff",
            "body": "Works better than tiger balm or biofreeze. Works best on my knees,legs, arms. Unlike other stuff there is no 'cooling' effect, the pain is actually numbed and stays that way for a long time. Definitely give it a try!",
            "rating": "4",
            "reviewer": "Jeff Piri"
        },
        {
            "title": "So far, so good",
            "body": "Just started using it. Need a while to know if it really makes a difference",
            "rating": "2",
            "reviewer": "Edward Brisson"
        },
        {
            "title": "Love it",
            "body": "Love it will be purchasing more",
            "rating": "5",
            "reviewer": "Michael Mooney"
        },
        {
            "title": "2 pump chump",
            "body": "Yo! You packing is super sweet and makes you feel good about the purchase. I would say it is not totally necessary if you wanted to save some dough and pass that on to the customer. My only feedback is the pump to dispense product does not work well. Totally inconsistent. Maybe a stronger return spring? Otherwise this stuff just plain works. We are rooting for you in the UFC. 👊🏻",
            "rating": "3",
            "reviewer": "Anonymous"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Dan Boelens"
        },
        {
            "title": "27:17",
            "body": "This stuff really does work. I had relief the very first time I used it.",
            "rating": "1",
            "reviewer": "Ben Chapman"
        },
        {
            "title": "",
            "body": "Hi I ordered my relief cream a couple weeks ago and it has not been delivered I would like to know I'd you guys could help with that",
            "rating": "5",
            "reviewer": "Gideon Stoker"
        },
        {
            "title": "This product works",
            "body": "I wanted to get off of the steroid my hand doctor was prescribing and stumbled across this product while doing some research for alternatives. After a few applications, my pain is gone and I no longer get the numbing in my fingers. This stuff works!",
            "rating": "5",
            "reviewer": "Jason Jakway"
        },
        {
            "title": "Works Suprisingly Well",
            "body": "Been using for a few days now on some recurrent sore points - can feel it getting to work pretty quickly.  Conveniently sized with barely noticeable pleasant odor.  Found it more effective than traditional heat type products.",
            "rating": "5",
            "reviewer": "William Campbell"
        },
        {
            "title": "",
            "body": "Really helps my joints",
            "rating": "5",
            "reviewer": "Justin Bartholomew"
        },
        {
            "title": "Knee Pain Relief",
            "body": "Started using over a week...    knees have been feeling so good.",
            "rating": "5",
            "reviewer": "Mitchell Cohen"
        },
        {
            "title": "Great",
            "body": "I put this on every morning. I wrestled in high school and now doing jiu jitsu and my shoulders were getting really sore and I was in pain. Using this they have turned around from where they were before and really feel better.",
            "rating": "5",
            "reviewer": "Nicholas Cashdollar"
        },
        {
            "title": "The Best I've ever used",
            "body": "I originally purchase 27:17 for hip and knee pain due to arthritis.  It worked almost instantly after the first application.  I typically have swelling around my knee and stiffness in my hip after leg day or cardio.  The swelling went down instantly and I've experienced significant flexibility in my hip as well. This was surprising enough but two days after the purchase my wife fell at work and sprained her wrist and fractured her elbow. 27:17 greatly reduced the pain and swelling in her wrist and hand and has lessened the pain and increased mobility in her elbow.  We already ordered more. 💪",
            "rating": "5",
            "reviewer": "Robert Greenaway"
        },
        {
            "title": "27:7",
            "body": "seems to relieve a little of the pain.. Just been a week",
            "rating": "5",
            "reviewer": "Brad Krebs"
        },
        {
            "title": "Great product",
            "body": "My primary care physician uses 27:17 and because of his success with your product, highly recommended it to me. He administered Prolo injections in my shoulder and recommended I order your product. I've been using 27:17 for four weeks and my shoulder issue is improving. Just like my doctor, I highly recommend 27:17.",
            "rating": "5",
            "reviewer": "Stanley Geisel"
        },
        {
            "title": "Two reviews in one",
            "body": "I bought a bottle for myself and a friend. We were both very impressed with how well it worked. My friend was also very impressed with the packaging it came in. I love that it’s made in America and was pleasantly surprised to get some Christian encouragement in my email. Thank you!",
            "rating": "5",
            "reviewer": "Angela Alford"
        },
        {
            "title": "Not received",
            "body": "Resenc",
            "rating": "5",
            "reviewer": "Jocelyn Eaves"
        },
        {
            "title": "",
            "body": "Absolutely worth it",
            "rating": "5",
            "reviewer": "Brian Carrier"
        },
        {
            "title": "",
            "body": "Smells good didn’t notice a huge difference is muscle soreness. Tried it for a month.",
            "rating": "3",
            "reviewer": "Ryan Harris"
        },
        {
            "title": "",
            "body": "Absolutely love it!",
            "rating": "5",
            "reviewer": "Nicholas Kisch"
        },
        {
            "title": "",
            "body": "Amazing pain relief. Doesn’t go on greasy and cleans up easily. Feel relief in about 20-30 minutes and each application seems to improve as I continue to use it more.",
            "rating": "5",
            "reviewer": "Sheridan Farrah"
        },
        {
            "title": "",
            "body": "Works great!",
            "rating": "5",
            "reviewer": "Daniel Beltran"
        },
        {
            "title": "",
            "body": "Doesn’t work for me",
            "rating": "2",
            "reviewer": "Richard Labahn"
        },
        {
            "title": "",
            "body": "It's great, I train BJJ and I use it everyday for my recovery. Thank you!!",
            "rating": "5",
            "reviewer": "Brandon Ballinger"
        },
        {
            "title": "Average",
            "body": "Nothing special about this product and way overpriced.",
            "rating": "3",
            "reviewer": "Joe Adams"
        },
        {
            "title": "It was okay",
            "body": "I think that overall, it was moderately helpful. However, I do not feel like it was worth the $50 for it. I would also add that It didn’t even last me a full month and there were about 5 days I didn’t even use it due to forgetting. So the amount, for the cost, a considering the effectiveness, I probably wouldn’t purchase it again. That’s just my experience. It might work well for others though.",
            "rating": "3",
            "reviewer": "Chance Kelosky"
        },
        {
            "title": "It’s just ok",
            "body": "Delivery was super fast. The product doesn’t seem to do much, I’ve been using it daily since I got it and can’t say I notice any benefit.  It’s smells ok, a bit “mediciney “ but not over powering.  Goes on easy.",
            "rating": "3",
            "reviewer": "Greg Davis"
        },
        {
            "title": "Great Stuff",
            "body": "Love it!!!",
            "rating": "5",
            "reviewer": "Gary West"
        },
        {
            "title": "?",
            "body": "Only been a week so not sure he will throw today and we will have a better idea . Fingers crossed",
            "rating": "5",
            "reviewer": "Thomas Wright"
        },
        {
            "title": "Pump sucks",
            "body": "Received product. The lotion works great however the pump is broke. I can barely get anything out of the bottle. For the amount this product costs, it’s a severe disappointment. 27:17 make it right. Send me a bottle that works",
            "rating": "1",
            "reviewer": "Scot Ruddock"
        },
        {
            "title": "",
            "body": "Didn’t do anything",
            "rating": "1",
            "reviewer": "Neil Dankowski"
        },
        {
            "title": "Review",
            "body": "By the next day, I could feel the difference in the areas that I applied it, I love the product and will continue to use this stuff.",
            "rating": "5",
            "reviewer": "Kyle Heake"
        },
        {
            "title": "So far so good",
            "body": "I have a bad shoulder and about 5 or six weeks ago I went to our doctor to get a shot in it about a week later my wife had an appointment and our doctor told her to have me get your product he was using it himself but between the shot and your cream my shoulder feels great",
            "rating": "5",
            "reviewer": "David Quinn"
        },
        {
            "title": "",
            "body": "Works as advertised. Has been a game changer in recovery and with my workouts. Will be purchasing again",
            "rating": "5",
            "reviewer": "R.L."
        },
        {
            "title": "Early days",
            "body": "I’m just getting started with your product. But so far it seems I’ve getting good relief from my muscle pain. I am very happy with the results.",
            "rating": "5",
            "reviewer": "Robin Gilbert Home"
        },
        {
            "title": "",
            "body": "It fires what it says it does",
            "rating": "5",
            "reviewer": "James Regina"
        },
        {
            "title": "Shoulder pain",
            "body": "Working well on shoulder pain. My son uses it also has wrestling elbow. The 1st 1 I received the pump dispensar was weird.",
            "rating": "5",
            "reviewer": "Foster Decorah"
        },
        {
            "title": "Not sure yet",
            "body": "Have a prev torn rotator cuff and tennis elbow. I’m testing it out though.",
            "rating": "3",
            "reviewer": "Aaron Philmon"
        },
        {
            "title": "So far so good",
            "body": "I got this for my husband he injured his elbow he finds it good as healing wise he feels since he is been using it has help a lot with his recovery that’s why we ended up getting more. He gifted his brother one bottle for his knee pain and he said it help him a lot with the pain so hopefully will help with the recovery as well.",
            "rating": "5",
            "reviewer": "Lynette Samaniego"
        },
        {
            "title": "Helped immediately",
            "body": "Got some inflammation relief on the second time I used it and it continues to provide the much needed relief for me to rehab by injuries!",
            "rating": "5",
            "reviewer": "M.M."
        },
        {
            "title": "too early to tell",
            "body": "been using twice a day for about a week (both elbows/forearms, shoulder)... so far little to no improvement",
            "rating": "2",
            "reviewer": "Neil Dankowski"
        },
        {
            "title": "Acrobat Recovery",
            "body": "I’m a professional acrobat with Achilles tendonitis and this stuff is amazing. I feel myself recovering better so I can keep doing my job and training what I love. Gonna be a regular order for me. 10/10 recommend",
            "rating": "5",
            "reviewer": "Myer Hursey"
        },
        {
            "title": "gift from the gods",
            "body": "It works amazing I had shoulder pain and elbow pain after Bjj. I rubbed this on and no BS the pain went away in mins. I’m pretty sure half the gym is using it now",
            "rating": "5",
            "reviewer": "Steve Hudec"
        },
        {
            "title": "46 and not so quick",
            "body": "I was a bit skeptical and even after my hamstring (after hearing 2 pops) was good to go in 2 weeks I didn’t fully attribute the quick recovery to 27:17…I’ve since referred it twice and received testimonials on it being “the real deal.” I’m using it on my elbows, knees, shoulders, and fingers and it’s helping extend my time on the mats in the gi.",
            "rating": "5",
            "reviewer": "Brady Webster"
        },
        {
            "title": "Good Product",
            "body": "As of right now only been using 27:17 for a couple of weeks and it is working so far but I’ll give A little longer to see the lasting effects.",
            "rating": "5",
            "reviewer": "Bernard Kahao"
        },
        {
            "title": "",
            "body": "Not sure if it works or not. I have been doing so many treatments for my injury that I’m just not sure. Smells good and might give it another try. It does last a while and you don’t need to use a lot.",
            "rating": "3",
            "reviewer": "Derek Liston"
        },
        {
            "title": "27:17",
            "body": "It seems to be working in the helps of recovering. I suffer from knee pain, back pain and shoulder pain. I have had 2 shoulder surgeries. Always looking for things to help. I would recommend this product.",
            "rating": "5",
            "reviewer": "CHAD WELLS"
        },
        {
            "title": "",
            "body": "Works somewhat won’t buy again",
            "rating": "3",
            "reviewer": "Armando Leal"
        },
        {
            "title": "",
            "body": "You have to use this product consecutively for it to work, but when it does, it’s a beautiful thing.",
            "rating": "5",
            "reviewer": "Ryan Hahn"
        },
        {
            "title": "Liquid gold!",
            "body": "I’ve been over training these past two months. Which has elevated my inflammation. Not only does it work but also smells great. Thank you 27:17",
            "rating": "5",
            "reviewer": "Pete Nelson"
        },
        {
            "title": "It’s fabulous!",
            "body": "It’s fabulous, it really works!",
            "rating": "5",
            "reviewer": "Christie Gessford"
        },
        {
            "title": "Outstanding",
            "body": "Using this product has become part of my post BJJ routine. I have genuinely noticed improved recovery.",
            "rating": "5",
            "reviewer": "Otto Bottin"
        },
        {
            "title": "This stuff WORKS",
            "body": "I have bad knees and a bad back I have tried everything to try to get some relief from the pain nothing works my son told me about 27:17 and I gave it a try  I just received my second bottle. This stuff is fantastic and it works fast with no unpleasant odor. I will continue to use this product",
            "rating": "5",
            "reviewer": "Brian Wark"
        },
        {
            "title": "So far so good",
            "body": "Only a few days in and i must say this is amazing stuff.",
            "rating": "5",
            "reviewer": "Kevin Piccioni"
        },
        {
            "title": "Love it",
            "body": "I love this product. Coming off acl surgery I was looking for anything that would help. I researched the ingredients in 27:17 myself and it’s LEGIT! It’s helped a ton. I’m on my second bottle.",
            "rating": "1",
            "reviewer": "Oliver Jenson"
        },
        {
            "title": "",
            "body": "Just began using it, seems to be working!",
            "rating": "4",
            "reviewer": "William Agar"
        },
        {
            "title": "feel zero benefit",
            "body": "i have been using it and i don’t seem to have no benefit of feel anything working for me",
            "rating": "1",
            "reviewer": "Jared Flippence"
        },
        {
            "title": "Best product I’ve ever used",
            "body": "I sustained a neck injury while training in Jitsu. I went to a nurse and insured my injury was only muscular then went to look for natural medicine alternatives. After taking ibuprofen for 4 days straight and couldn’t get any relief and still couldn’t turn my neck. A friend of mine had been talking about 27:17 for a few weeks and after 3-4 days of suffering I figured it was worth the risk.After applying twice (one time when I got it and then again before bed) I woke up feeling 70% better. I’ve been applying it every day since and my neck is 98% better. I highly highly recommend this product. I’m considering buying another one just to stick in the medicine cabinet. Right now this one goes everywhere with me.",
            "rating": "5",
            "reviewer": "Blake Barlow"
        },
        {
            "title": "",
            "body": "Love it",
            "rating": "5",
            "reviewer": "Reid Horrow"
        },
        {
            "title": "Undecided",
            "body": "I’ve been using it every day and I haven’t noticed any change/benefit",
            "rating": "1",
            "reviewer": "Ted Pettle"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Martin Prodanov"
        },
        {
            "title": "Awesome product",
            "body": "I love this product. I have been suffering from pain for a while now, and using 27:17 has helped with the pain and recovery. It has been a great tool to combine with my physical therapy. I have also helped with my knee pain from wrestling and BJJ. i use it every day and love it.",
            "rating": "5",
            "reviewer": "Zane Sisneros"
        },
        {
            "title": "",
            "body": "Love it",
            "rating": "5",
            "reviewer": "michael reis"
        },
        {
            "title": "",
            "body": "Amazing omg",
            "rating": "5",
            "reviewer": "Vernon Shelton"
        },
        {
            "title": "Amazing product",
            "body": "I was so afraid to run out of my first can, that I just ordered 4 of them so that I don’t have to worry about it :).The product is amazing, and I use it every time I train BJJ",
            "rating": "5",
            "reviewer": "Marco Rosa"
        },
        {
            "title": "",
            "body": "This is a no for me! It basically lotion with essential oils. There are better products out there! Very over priced for what you get.",
            "rating": "1",
            "reviewer": "Marisa Ortiz"
        },
        {
            "title": "Not certain yet.",
            "body": "Not sure yet if it actually works yet. Perhaps its for athletic people. I'm not in any good physical shape but I would consider myself an industrial athlete. I'm constantly climbing on commercial rooftops with a heavy toolbag and often haul equipment as well. I crawl through residential attics.Part of my job requires lifting, kneeling, crouching and holding still on knelt positions for extended periods of time. I'm and HVAC tradesman. I had this last amount of hope that this product would be the miracle for my lower back ache.  I've gone to chiropractors and specialists with no solutions. I figured that I have nothing to lose with thos cream. I'll keep trying it to see if there is any improvement.  If it don't, surgery is next which I have tried to avoid for years. Wish me luck",
            "rating": "3",
            "reviewer": "Miguel Esquivel"
        },
        {
            "title": "Faulty pump",
            "body": "Unfortunately the pump broke once it arrived. I was able to squeeze a little out and what I could use I did feel a difference over. Ight. I ordered another bottle to give it a shot. Confident I will be pleased with the results",
            "rating": "5",
            "reviewer": "Spencer Moore"
        },
        {
            "title": "",
            "body": "Great product. Helps healing",
            "rating": "5",
            "reviewer": "Shawn Burnette"
        },
        {
            "title": "",
            "body": "Works like it says.",
            "rating": "5",
            "reviewer": "Tyler Ross"
        },
        {
            "title": "",
            "body": "Works so good!!!!",
            "rating": "5",
            "reviewer": "Amanda Wheeler"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "ROB W ZIEBELL"
        },
        {
            "title": "",
            "body": "Magic.",
            "rating": "5",
            "reviewer": "Jack Atherton"
        },
        {
            "title": "2717",
            "body": "First off the packaging is great very high end I'd say, but i feel like I'm paying  for it..I would be just as happy if it came in a brown paper bag if it was less expensive. The pump on the bottle didn't work like it should I'd have to pull it up to pump out each time besides that it seems like good stuff still using it and ordered two more with the 30 bucks off code and gave one to my son to try out and I'll use the other one..",
            "rating": "4",
            "reviewer": "Gene Robinette"
        },
        {
            "title": "",
            "body": "The absolute best I have ever used.",
            "rating": "5",
            "reviewer": "Jim Thompson"
        },
        {
            "title": "",
            "body": "I love it",
            "rating": "5",
            "reviewer": "Jahmes Bonner"
        },
        {
            "title": "As Iron sharpens Iron",
            "body": "I have a titanium plate and cadaver bone in my right arm to replace my ulna from a bone cancer. My arm will hurt a bit after rolling and I would have to take a break before getting back out. I used 27:17 and it helped relieve the pain and reduce it overall. I’ve used it on my knees and anywhere else that gets sore or bruised. Pretty work folks",
            "rating": "5",
            "reviewer": "Tyler Ross"
        },
        {
            "title": "",
            "body": "It actually works. This stuff is not a joke.",
            "rating": "5",
            "reviewer": "Jeremiah Bailey"
        },
        {
            "title": "Love it",
            "body": "I love this topical cream for my shoulder pain. I get bicep tendinitis often and this helps soothe the pain I have after doing pottery or working out.  My son, who is 12, has also used the cream on his elbow after baseball, works wonderful! I highly recommend this product to anyone who has minor strains or tendinitis!",
            "rating": "5",
            "reviewer": "Angela Baustert"
        },
        {
            "title": "Great product",
            "body": "Grade A stuff right here!",
            "rating": "5",
            "reviewer": "Noel Rivera"
        },
        {
            "title": "World of difference",
            "body": "I am in a Police academy and after 40hr block of defensive tactics I was hurting. Tried icy hot with lidocaine and was taking that IBU like crazy this stuff worked! Made a world of difference I was so surprised.",
            "rating": "5",
            "reviewer": "Alex"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "4",
            "reviewer": "Doug Hidalgo"
        },
        {
            "title": "Great experience",
            "body": "I received the product and 1st bottle would not pump no matter how many times I tried. I sent an email for help and very quickly I saw sent another bottle without any thing else for me to have to do or explain. I appreciate that you made it very simple and did the right thing for me as a customer. I’ve used the product multiple times now and it works great, the smell and feel are also great. I would definitely recommend this product and will continue to use. Thank you once again for a great customer experience and product.",
            "rating": "5",
            "reviewer": "Peter Panagedes"
        },
        {
            "title": "Worth it",
            "body": "Once I put it on, I feel much better in 30 minutes.",
            "rating": "5",
            "reviewer": "Ernesto Cuellarsola"
        },
        {
            "title": "Great product",
            "body": "If you are on the fence about this product, don't be. This product works and it has been a game changer for me. I have been out of the gym for over year due to injury, recovery from surgery and in that time developed a lot of joint pains from not moving. I have suffered with psoriatic arthritis as well for years and also applied this to some painful joints. I am in no way saying this is marketed for that but I tried it and woke up feeling great. The recovery the following say has been truthfully a game changer for me. On top of that customer service is great and the prduct smells good. I go to work now and do not smell like tiger balm 90% of the time. Great product!!",
            "rating": "5",
            "reviewer": "Bert Rivero"
        },
        {
            "title": "27:17 review NC",
            "body": "I think it’s a good product haven’t been using it but a few days but applying it twice day, has too a good amount of inflammation out of my knees and back so we will see how it continues to do",
            "rating": "4",
            "reviewer": "Tyler Stoltzfus"
        },
        {
            "title": "",
            "body": "Amazing I’m so thankful for this product God and this product is the key from staying away from surgeries",
            "rating": "5",
            "reviewer": "Vernon Shelton"
        },
        {
            "title": "27:17",
            "body": "HelloThe pump doesn't work very well so it's difficult to get the product out. It seems to help my pain a little, but I haven't noticed a big difference 😕",
            "rating": "3",
            "reviewer": "Erin Govoni"
        },
        {
            "title": "It works",
            "body": "Legit",
            "rating": "5",
            "reviewer": "BIG T BIG T"
        },
        {
            "title": "First time user",
            "body": "I have been using 27:17 for 5 days now. I have had knee issues since I was a teenager when I fell off a roof. It has always been manageable pain, but uncomfortable none the less. Ever since using 27:17, once a day, I haven’t had any knee pain or mobility issues. What I thought was going to be my way of life with my knee pain is suddenly gone and I have this new freedom of mobility that’s came with it. I do a lot of hard workouts (rucking, sand bag workouts, kettlebells, and body weight workouts with weight vests) and even in doing those, still no knee pain. I was shocked. I was 50/50 when I bought it on if it would work or not, but I figured what could it hurt. And I’m so glad I ended up getting it. Thanks 27:17!",
            "rating": "5",
            "reviewer": "Joshua Binegar"
        },
        {
            "title": "Satisfied Happy Customer!",
            "body": "I liked the texture and the smell! I also loved the way it is deep penetrating and quick working to relieve soreness.Under two weeks and my mobility and strength is coming back.",
            "rating": "5",
            "reviewer": "Andrew Paquette"
        },
        {
            "title": "It hasn't done anything to help",
            "body": "I can't say it's good or bad as it does not help me or my wife. We felt nothing once applied.I am sorryJP",
            "rating": "1",
            "reviewer": "Josef Peot"
        },
        {
            "title": "It Works!",
            "body": "My husband has been  suffering from tennis (pickleball) elbow for nearly a year. He started using 27:17 and noticed improvement within the first couple of days. I use it on my wrist (achy after 35 years as a hairdresser...I’m 74) and it is helping me as well. I told my sons about it (former athletes) and one of them had already ordered it before I told him about it. He likes it as well! Our massage therapist told us about it so kudos to her and kudos to you all for a great product Thank You!",
            "rating": "5",
            "reviewer": "Christine Berthelsen"
        },
        {
            "title": "???",
            "body": "Never received it",
            "rating": "1",
            "reviewer": "Justin Ratliff"
        },
        {
            "title": "",
            "body": "This product did not work for me.",
            "rating": "1",
            "reviewer": "Matthew Dolan"
        },
        {
            "title": "pump on container",
            "body": "The pump on my contain doesn't work correctly.  I can barley get the lotion out of it.  it is super frustrating to use.  I don't even know if it works because it I can barley get it out.",
            "rating": "2",
            "reviewer": "Todd Brunner"
        },
        {
            "title": "",
            "body": "This product is legit! Had a cramp developing the other night, applied it and within seconds the cramp went away. Highly recommend.",
            "rating": "5",
            "reviewer": "Jorge Esquivel"
        },
        {
            "title": "",
            "body": "Bought for my mom with arthritis and it works like a charm.",
            "rating": "5",
            "reviewer": "Paul Gamperl"
        },
        {
            "title": "Meniscus surgery",
            "body": "I started using few days before surgery didn’t notice much but after I’ve been up walking and standing all day at wrestling tournaments and practices. It calms the burn and has helped tremendously with the swelling. I can now feel the difference a few minutes after using it. I’ve even used it on my hip that started hurting from my limp from my injury. Good stuff and I’m going to definitely keep using and order more.",
            "rating": "5",
            "reviewer": "Brian Nestor"
        },
        {
            "title": "Amazing Product",
            "body": "The product is life changing! Took away all of my shoulder pain and now I am back to lifting heavy weights! Only thing is I got the same coupon code sent to me 2x so I couldnt use the 2nd one! Besides that I am very happy!",
            "rating": "5",
            "reviewer": "Kevin Jansen"
        },
        {
            "title": "Shoulders",
            "body": "Outstanding product  relieves pain in minutes and not average pain competition jiu jitsu pain! It’s in my recovery routine dailyM",
            "rating": "5",
            "reviewer": "CHAD BOWANS"
        },
        {
            "title": "Shoulder Pain",
            "body": "I’ve had reoccurring shoulder pain for several years. I’ve been using 27:17 Recovery for 5 days and my shoulder feels much better. I’ve been putting on age. I get up in the morning and post workout. Great product as far as I’m concerned.",
            "rating": "5",
            "reviewer": "Glenn Hawkey"
        },
        {
            "title": "It has definitely  helped",
            "body": "I'm an old cowboy  who  has a been dinged up over the  years.  And still living an active  lifestyle  by reffing sports at the varsity  level of high school to little  kids sports.   It's definitely  early  in the  trial but I have definitely  noticed  improvements  in  managing my discomfort.",
            "rating": "4",
            "reviewer": "Anonymous"
        },
        {
            "title": "Lifesaver",
            "body": "I was unable to put any weight on one of my legs so I could not walk. After using this cream I was able to put weight on my leg and walk until the doctors figure out what’s up.",
            "rating": "5",
            "reviewer": "Sherry Larck"
        },
        {
            "title": "Bad knees",
            "body": "Struggle with knee pain on a daily basis. 27:17 has been a godsend reducing inflammation and helping with recovery",
            "rating": "5",
            "reviewer": "Mark Fitzgerald"
        },
        {
            "title": "Torn pec..No Factor",
            "body": "I tore my pec three weeks ago, I have been applying 27:17 for the last week and so far it seems to be helping. I am planning to use it throughout my rehab. I am grateful for the opportunity to use this product on my journey!",
            "rating": "5",
            "reviewer": "Chris Zeller"
        },
        {
            "title": "Bran New me !!",
            "body": "Absolutely works and works FAST !!!",
            "rating": "5",
            "reviewer": "Chris Luker"
        },
        {
            "title": "It's Great",
            "body": "Great product works",
            "rating": "5",
            "reviewer": "Dennis Mitchell"
        },
        {
            "title": "",
            "body": "Miracle in a can.",
            "rating": "5",
            "reviewer": "Austin Dalton"
        },
        {
            "title": "",
            "body": "I recently had surgery on my knee. I have been using 27:17  throughout my recovery and it has made a very noticeable difference. With physical therapy 5 days a week I’m constantly testing and pushing my body and fighting to get better and rebuild muscle and strengthen these new ligaments that I’ve had to have reconstructed. 27:17 has allowed me to keep pushing through healthy levels of pain, approach each day with a strong mentality and keep an unwavering amount of confidence in myself and my bodies  capabilities. This is a product that allows your body to thrive when paired  with a mentality to strive for better each day. I would recommend this for athletes, PT patience’s, and to even someone who has a labor intensive job. Everybody could benefit from this product",
            "rating": "5",
            "reviewer": "J.L."
        },
        {
            "title": "",
            "body": "An excellent anti inflammation cream that helps me recover faster and get back at it harder. Working out hard and lifting heavy weights typically leads to sore muscles. Stretching and this cream are the answer to reducing that soreness by 70-80%.",
            "rating": "5",
            "reviewer": "Brandon Foust"
        },
        {
            "title": "",
            "body": "It’s a good product. I’ve been using it on just sore joints, and some calf muscles seems to relieve some of the strain on the muscles and soreness. Definitely has helped improved with some recovery after runs. ￼",
            "rating": "5",
            "reviewer": "John O`Coy"
        },
        {
            "title": "",
            "body": "Super amazing",
            "rating": "5",
            "reviewer": "Vernon Shelton"
        },
        {
            "title": "",
            "body": "Can’t say how, but it works ￼",
            "rating": "5",
            "reviewer": "K.W."
        },
        {
            "title": "",
            "body": "Unable to use. The pump does not work.",
            "rating": "1",
            "reviewer": "Christopher Charleston"
        },
        {
            "title": "",
            "body": "This product helped me a lot after throwing out my lower back.",
            "rating": "5",
            "reviewer": "Greg Paxson"
        },
        {
            "title": "Not much difference",
            "body": "I’ve been using this daily for almost three weeks and I’ve not notice any difference",
            "rating": "1",
            "reviewer": "Matt Patillo"
        },
        {
            "title": "",
            "body": "Ok",
            "rating": "2",
            "reviewer": "Michael McGraw"
        },
        {
            "title": "Sweet Relief",
            "body": "I had heard great things about 27:17 and it is all true. I tore my left quad in half last year and after the repair it has been a grind of recovery. This is really helping with the soft tissue swealing that persists but I am now seeing some relief.Thank you 27:17!!",
            "rating": "5",
            "reviewer": "STEVE HOWARD"
        },
        {
            "title": "Seriously powerful stuff",
            "body": "This stuff works. I’m a jiu-jitsu guy among many other hobbies so I’m constantly dinged up. I recently had an ankle sprain from trail running and this is the first time I’ve used the cream for injury recovery vs just regular soreness relief. These sprains are common for me on these technical NE trails. But this recovery was anything but common. I did everything business as usual except the 27:17 cream. I lathered this stuff on several times a day and this recovery has easily been cut down by more than half. Also pretty amazing to see a product with one of my favorite scriptures on it. :)",
            "rating": "5",
            "reviewer": "Joseph Montgomery"
        },
        {
            "title": "Great customer Service",
            "body": "I bought the cream and i received the email that it was delivered. Go check my box and nothing.. the post office lost my package. I email the 27:17 team and they respond immediately and sent me another one.. i offered to pay the cost or half and they wouldn’t have it.. talk about great customer service. If you’re in the fence admit ordering this product, i would say just order it.. these people are not here to screw your over. Thank you for such great service",
            "rating": "5",
            "reviewer": "Taos Ford"
        },
        {
            "title": "Worth Every Penny",
            "body": "Love your product",
            "rating": "1",
            "reviewer": "Lynn Thompson"
        },
        {
            "title": "",
            "body": "Wow.",
            "rating": "5",
            "reviewer": "Isaac Phillips"
        },
        {
            "title": "Could be better",
            "body": "Not as good as I thought.",
            "rating": "2",
            "reviewer": "Evan Rizzitello"
        },
        {
            "title": "Legit",
            "body": "Have had a nagging knee pain tender to touch for months, used this and within 2.5 weeks no more tenderness",
            "rating": "5",
            "reviewer": "Jonas Newell"
        },
        {
            "title": "Worked for me!",
            "body": "My son was using 27:17 on his knee and was very pleased with the results he was achieving. He recommended I try it on my shoulder. Within a few days of use, I noticed a drop in pain level.",
            "rating": "5",
            "reviewer": "George Parrado"
        },
        {
            "title": "It's been working",
            "body": "I look at a lot of the reviews. Yes the bottle isn't to big but you don't really need a lot. I put it on twice a day and I've noticed a lot better movement in my neck",
            "rating": "5",
            "reviewer": "Grant Schick"
        },
        {
            "title": "I really wanted this to work...",
            "body": "Unfortunately, I have not felt any noticeable difference since using this product.  I sent back the 2nd shipment and cancelled my subscription.",
            "rating": "1",
            "reviewer": "Nick Milligan"
        },
        {
            "title": "Voodoo",
            "body": "Was skeptical, but relieved my soreness and inflammation within minutes!",
            "rating": "5",
            "reviewer": "Haden Roberts"
        },
        {
            "title": "It feels like it's working slowly",
            "body": "I just have started to use it over like 5 days. I feel like it's working but I can't really tell too much of a difference. But time will tell.",
            "rating": "4",
            "reviewer": "Tanzim Zaman"
        },
        {
            "title": "It’s been good.",
            "body": "I do feel better after applying.  Over the course of the day, the soreness does come back.  Hoping for continued improvement over the course of the next couple of weeks.",
            "rating": "4",
            "reviewer": "Rex Walters"
        },
        {
            "title": "",
            "body": "This stuff is magic!!!! Buy it!!!",
            "rating": "5",
            "reviewer": "Tifany Trees"
        },
        {
            "title": "It works!",
            "body": "I’m in the police academy and I teak my knee. I need to push through and still get my objectives done. I get some acupuncture the first day I get a chance and while there I see the 27:17 ad on IG. I remember hearing about this magic cream from watching Bo on the JOCKO podcast. I go can’t hurt gotta try this stuff. First off super fast shipping got it the very next day. Then boom start putting it in twice a day minimum and in less than a week I noticed a big drop in my daily pain of still pushing it. About 2 weeks I’m 100% and back at it. I know 27:17 is the reason I was able to push and keep going. I bought a second bottle already to have on stand by for any body soreness or injuries that may arise. Thanks for sharing this and helping us get healed up quickly.PS I like the smell also much better than most creams.Thank you",
            "rating": "5",
            "reviewer": "Craig Marsh"
        },
        {
            "title": "No results",
            "body": "Company and mission are great but I’m sorry I don’t feel any different using the product; tried twice in a day and feel nothing.",
            "rating": "1",
            "reviewer": "Mark Olthoff"
        },
        {
            "title": "Coach power.",
            "body": "I am a wrestling coach 25yrs.. I use it for my shoulder.. We coaches have some issues with pain. I have all 3 of my coaches ordering it. I’ve also told the other coaches in other sports.. We’re all believers! Thank you!",
            "rating": "5",
            "reviewer": "Felix Hernandez"
        },
        {
            "title": "27;17 new PRODUCT",
            "body": "not sold on it just yet",
            "rating": "3",
            "reviewer": "Matthew Stratton"
        },
        {
            "title": "27-17",
            "body": "It's good stuff but I wish it would last longer then 8 hrs. I work 10-12 hours a day",
            "rating": "5",
            "reviewer": "Diane Millard"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "4",
            "reviewer": "Jason Sedbrook"
        },
        {
            "title": "",
            "body": "Honestly didn't help with my pain",
            "rating": "5",
            "reviewer": "Luis Garcia"
        },
        {
            "title": "I did not receive my order!!",
            "body": "I have been working out of town and when I finally got home. My order was nowhere to be found. I checked with USPS and they couldn;t find anything.",
            "rating": "1",
            "reviewer": "Jason Witherspoon"
        },
        {
            "title": "How 27:17 works",
            "body": "My son told me about this product and also said it was really goodl, so I purchased  the item, used it for the first night, and I noticed a difference right away, started putting it on my back and hips, where the worst of my pain is at, it helped tremendously. Also put it on my hands and my thumbs have really bad arthritis and it’s stopped it from hurting, I use it every day few times a day it does help with the pain, of course it will never get rid Of my medical issues on my back and hip but it sure did ease it up, I highly recommend this product and I will definitely be ordering it again",
            "rating": "4",
            "reviewer": "Jerri Lynn Kelly"
        },
        {
            "title": "Tried 27:17 for back cramps.",
            "body": "I have had five surgeries on my back since 2007. As a result I have multiple cramps nightly (as many as 20+). I decided to try 27:17 after a recommendation from a friend. It took about a week of using it nightly before I started having fewer cramps and after three weeks I’m down to one or two cramps per night and sometimes none all night. It sure seems to be helping me get better sleep.PS: I stopped using 27:17 for a few days last week and the cramps started coming back, so I’m back to using it nightly again.K. P.",
            "rating": "5",
            "reviewer": "Ken Hazelbaker"
        },
        {
            "title": "I'da never thunk it...",
            "body": "I'da never thunk that after 25 years of aching, knee pain could go away.  That stuff is simply amazing 👏!It's ached for so long, I'm actually going to miss not feeling well.",
            "rating": "5",
            "reviewer": "Sean Mottishaw"
        },
        {
            "title": "Still deciding",
            "body": "Been using a couple times a day for about a week on an achy shoulder. Haven't noticed much improvement but going to continue applying.",
            "rating": "3",
            "reviewer": "Tyrell Marble"
        },
        {
            "title": "Great product!",
            "body": "Great product, great ingredients. Would highly recommend in a market of a bunch of fakes, this one delivers!",
            "rating": "5",
            "reviewer": "Paul Jackow"
        },
        {
            "title": "",
            "body": "I recently had the pleasure of trying the 27:17 Recovery Cream, and I must say it exceeded my expectations in every way. Injured my groin in ice hockey which forced me to look for something on the market to aid my recovery. This cream is truly a game changer when it comes to recovery.First and foremost, the results are remarkable. After just a few uses, I noticed a significant improvement in the overall texture and appearance of my skin. Swelling and bruising began to fade away within days of use.The 27:17 Recovery Cream absorbs quickly into the skin. It doesn't leave any greasy or sticky residue behind, making it perfect for both day and night use. The cream has a pleasant, subtle scent that adds to the experience. I appreciate that this cream is formulated with high-quality ingredients that are known for their healing properties. Overall, the 27:17 Recovery Cream has become an essential part of my recovery routine.",
            "rating": "5",
            "reviewer": "Ryan Garza"
        },
        {
            "title": "",
            "body": "Not sure if I’m using it wrong lol but very minimal pain relief",
            "rating": "3",
            "reviewer": "Jonathan Velez"
        },
        {
            "title": "",
            "body": "This product works!! I’ve used it on both of my knees & felt a huge difference within the first couple of days.",
            "rating": "5",
            "reviewer": "AMANDA BLACKMAN"
        },
        {
            "title": "Awesome",
            "body": "Expensive but works great",
            "rating": "5",
            "reviewer": "Greg LaFex"
        },
        {
            "title": "",
            "body": "Great product you need to try it",
            "rating": "5",
            "reviewer": "James Houghtailing"
        },
        {
            "title": "",
            "body": "Best product I have bought for myself as a professional jui jitsu competitor",
            "rating": "5",
            "reviewer": "Michael Olivares"
        },
        {
            "title": "As advertised!",
            "body": "Package delivered yesterday, immediately put on my shoulders. Had no pain whatsoever for rest of the day. Thank you!",
            "rating": "5",
            "reviewer": "Jacob Clay"
        },
        {
            "title": "Great",
            "body": "Works well to control pain from arthritis and injuries in my feet.",
            "rating": "5",
            "reviewer": "Kevin Williams"
        },
        {
            "title": "I think it's helping",
            "body": "I have only used it a week,  but it seems to be helping",
            "rating": "5",
            "reviewer": "Scott Farabaugh"
        },
        {
            "title": "Good product but not for everyone",
            "body": "I used this after suffering a tear in my rotator cuff and tearing my labrum as well as bulging 3 discs in my C-spine. The inflammation was horrible and this product worked better than the supposed highest grade steroids my doctor prescribed and even better than injections. My only gripe when I see people talk about this product is its healing properties which I don't believe exist, but this product does work great for reducing inflammation even better than medicine in my experience.",
            "rating": "5",
            "reviewer": "autumn oboyle"
        },
        {
            "title": "Works almost immediately",
            "body": "I have issues with my elbows from heavy bench and triceps workouts. I am pain free during my workouts. What pain I can see to have after my works outs is gone as well. It is healing my ligaments and tendons.",
            "rating": "5",
            "reviewer": "Richard Tate"
        },
        {
            "title": "",
            "body": "Bad",
            "rating": "1",
            "reviewer": "Seyedmehran Mokhtarimoosavi"
        },
        {
            "title": "27:17 review",
            "body": "Only had 7 days but I was surprised there wasn’t much lotion in it only used sparingly amounts and I noticed alittle but not as much as the hype maybe if I had gotten a full bottle there was lotion in the packaging. But I will continue to squeeze the last drops. No one said how long the lotion should last. I felt something just not enough to really say yes it works great.",
            "rating": "3",
            "reviewer": "Tim Fredenburg"
        },
        {
            "title": "Only complaint",
            "body": "The cap does not stay on. We are a wrestling family. This kids that wrestle so I carry it in my bag and I was constantly trying to find the lid and it ended up getting on a few things in my bag. Def putting it in a plastic bag next tournament. Seem to work good so far. Still a little early to tell",
            "rating": "3",
            "reviewer": "Jimmieanne Demaroney"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Michael Koeth"
        },
        {
            "title": "",
            "body": "Using 27:17 cream helps me recover at night. I have knee pain and arthritis and when I use it relieves the pain and feel a lot better in the morning. First bottle worked so good I ordered two more!",
            "rating": "5",
            "reviewer": "Chuck Agathangelou"
        },
        {
            "title": "Amazing results!!",
            "body": "Struggling to recover from a partial tear in my posterior tibial tendon. Started using 27:17 and I felt immediate relief. I will continue to use it regularly. Great stuff!!",
            "rating": "5",
            "reviewer": "Anonymous"
        },
        {
            "title": "Really works",
            "body": "I've had elbow pain for almost a year it made me not able to do lots of bicep or forearm concentrated exercises a month and a half I feel I have my arm back... this stuff is miracle cream",
            "rating": "5",
            "reviewer": "Frank Rose"
        },
        {
            "title": "Nice to see it actually works!",
            "body": "Happy to feel the relief and very nice to know that there is no CBDs in this product.",
            "rating": "5",
            "reviewer": "Marcus Hull"
        },
        {
            "title": "27:17",
            "body": "Son used on knees after long wrestling tournament.  Said he felt improvement and no strange smell.  Purchased more.",
            "rating": "5",
            "reviewer": "Trey Haury"
        },
        {
            "title": "Awesome",
            "body": "Had some serious golf elbow from lifting weights and the pain has literally cut down greatly finally feel like it's healing",
            "rating": "5",
            "reviewer": "Donald Van natten"
        },
        {
            "title": "",
            "body": "Haven’t felt any changes yet after two weeks",
            "rating": "3",
            "reviewer": "John Baker"
        },
        {
            "title": "It works!",
            "body": "2717 recovery cream has helped speed up healing of a knee injury. Pain became way less, and range of motion increased significantly with the help of this product.",
            "rating": "5",
            "reviewer": "Sean Ideta"
        },
        {
            "title": "Not noticed",
            "body": "Unfortunately I didn’t notice any impact.",
            "rating": "2",
            "reviewer": "Clayton Pummill"
        },
        {
            "title": "So far so good",
            "body": "So far feeling results in my lower back!! I am very active, crossfit + 3miles a day, and I can feel a difference.",
            "rating": "5",
            "reviewer": "Dawn Elliott"
        },
        {
            "title": "First time user",
            "body": "How does it take to notice recovery? Should I put the product on everyday or every other?",
            "rating": "3",
            "reviewer": "Booker Bell"
        },
        {
            "title": "Great product!",
            "body": "This cream has helped immensely with ligament pain in my knee. I have a whole closet full of random pain relieving gels/creams and none of them compare. I love that it quickly absorbs into the skin & isn’t greasy. I will definitely be reordering soon.",
            "rating": "5",
            "reviewer": "Dana Thompson"
        },
        {
            "title": "Old dude needs help",
            "body": "60 years old work in a oil refinery, Climbing ladders turning valves. Needed help. Now I’m out working the young guys.",
            "rating": "5",
            "reviewer": "jack easley"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Andrew Schneider"
        },
        {
            "title": "Amazing!!!",
            "body": "I had my should completely repaired from injuries in the military, I’m also a big archery hunter and drawn the bow was really hard on my should and caused a lot of pain. Since using this product I have no pain while shooting my bow every after shooting 200 plus arrows.",
            "rating": "5",
            "reviewer": "Frank Sandstedt"
        },
        {
            "title": "Truly amazing",
            "body": "…🫶🏽",
            "rating": "5",
            "reviewer": "Devin Stone"
        },
        {
            "title": "Great product Weird smell",
            "body": "I’ve used the product for about a week after my runs. My next day fatigue does in fact feel less. Def could work on the scent though. Feel like I smell like a large pickle.",
            "rating": "5",
            "reviewer": "LEE GILLIAM"
        },
        {
            "title": "Not yet!",
            "body": "Only been using it for two weeks, so I really want to give it a chance, but so far I have not noticed any relief",
            "rating": "2",
            "reviewer": "Mike campofredano"
        },
        {
            "title": "Miracle potion",
            "body": "I was skeptical purchasing but had a good hunch to do so, not a single regret to say the least. Do everything from death metal drumming to jiu jitsu this stuff really helps with achey joints and pains",
            "rating": "5",
            "reviewer": "Carlos Gonzalez"
        },
        {
            "title": "Truly impressed",
            "body": "I have to admit I was skeptical at first. My son is a Sophomore in high school and he tends to have knee pain after wrestling practice. I started applying 27:17 after practice when he was sore and it alleviated his pain (and I find the aroma pleasing). Thank you!",
            "rating": "5",
            "reviewer": "Donna Garrett"
        },
        {
            "title": "Real Relief",
            "body": "I’m 58 years old and I am dealing with soreness from playing college football27:17 is the first product that actually offers relief.  Thank you for creating this product",
            "rating": "5",
            "reviewer": "Scott Sypniewski"
        },
        {
            "title": "AMAZING!!!",
            "body": "5 stars all the way!!!!! ⭐️⭐️⭐️⭐️⭐️",
            "rating": "5",
            "reviewer": "Talan Hubbard"
        },
        {
            "title": "Shits Dope",
            "body": "Joints feel 10 years younger",
            "rating": "5",
            "reviewer": "William Williams"
        },
        {
            "title": "Not bad",
            "body": "It’s has a weird smell when first applied.  Been using it about a week. Feels like it’s doing something after applying not sure if it’s really working or just a waste of money will continue to use",
            "rating": "3",
            "reviewer": "Shaun Carothers"
        },
        {
            "title": "Hopeful relief",
            "body": "I have been using this product for about a week.  My knees might be too far gone for anything to help considering I have arthritis in both knees and the left one needs replaced.  I'm still hoping that this cream helps some with the constant achiness I get after working out.  Still hopeful.",
            "rating": "4",
            "reviewer": "Rick Bonett Jr."
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "2",
            "reviewer": "Jeff Krise"
        },
        {
            "title": "2717",
            "body": "It actually does work",
            "rating": "5",
            "reviewer": "James Deeks"
        },
        {
            "title": "Miracle Cream!",
            "body": "I purchased 27:17 for my 16 year daughter who is an athlete and is currently recovering from an injury. She absolutely loves it and calls 27:17 her Miracle Cream. Not only is helping her knee feel better, it smells great. Thank you Recovery 27:17! - Mama Delfin",
            "rating": "5",
            "reviewer": "Monique Delfin"
        },
        {
            "title": "",
            "body": "Excellent",
            "rating": "5",
            "reviewer": "Fernando Rodriguez"
        },
        {
            "title": "Feeling great",
            "body": "I've been using 27:17 for a little over a week and the pain in my knees and shoulders have been significantly reduced. I can't wait to see how I feel at the end of the month.",
            "rating": "5",
            "reviewer": "David Calkins"
        },
        {
            "title": "",
            "body": "Works wonders",
            "rating": "5",
            "reviewer": "Rhys Humphries-Wadsworth"
        },
        {
            "title": "So far so good",
            "body": "Have been using for about a week and have seen relief to some nagging shoulder soreness",
            "rating": "5",
            "reviewer": "Tom Brosnahan"
        },
        {
            "title": "It actually worked",
            "body": "I sort of still don't believe it, chronic \"golfers elbow\" for over a year, a month in massaging 27.27 above & below elbow everyday for a fortnight then alternate days then occasionally it's not troubling me. I haven't pushed it to the limit yet but am unbelievably impressed.",
            "rating": "5",
            "reviewer": "Paul Bateman"
        },
        {
            "title": "",
            "body": "Works as advertised! Had an injury to my bicep and came across this product. It has allowed me to get through workouts and has noticeably accelerated the healing process.Side note(in your survey email, change your last sentence from the “whole 27:27 team” to the “whole 27:17” team. It’s a great product so surround it with perfection.",
            "rating": "5",
            "reviewer": "Richard Kloss"
        },
        {
            "title": "Bro!!!",
            "body": "This stuff is amazing!!! My elbow has been killing me and I was suffering during lifting. Not anymore!! This stuff is the real deal. Thank you!",
            "rating": "5",
            "reviewer": "Matthew Villarrral"
        },
        {
            "title": "Works",
            "body": "I have been using this product on my left arm and it has been working well.",
            "rating": "1",
            "reviewer": "Matthew Berger"
        },
        {
            "title": "This product lives up to my expectations",
            "body": "By using this cream, I have been able to continue training Jiu-Jitsu and lift weights with minimal recovery time and soreness. I appreciate the product and how it keeps me “in the fight.”",
            "rating": "5",
            "reviewer": "Marco Rafalovich"
        },
        {
            "title": "Seeing Results",
            "body": "Have been using on low back for the last 2 weeks. Seems to be improving. Time will tell.",
            "rating": "5",
            "reviewer": "GARY ROBINSON"
        },
        {
            "title": "Seems to be healing. Not just masking",
            "body": "I wanted to wait atleast 7 days after I started using your product to give a review. I am 45 years old. I suffer from gout in my feet and hands as well as tendinitis in my elbows and knees mixed in with arthritis throughout my body, especially right now while it getting colder outside. So in the last 7 days I applied your product on my areas that bother me the most and what I noticed, is that it took about 4 days for it to start feeling like it's actually might be healing not just trying to mask the pain. So for now it seems great and I have recommended it to a lot of my friends and family. I am looking forward to continued improvements.",
            "rating": "5",
            "reviewer": "Jeremy Peppers"
        },
        {
            "title": "This stuff is great!!",
            "body": "Lets me keep training during injury.",
            "rating": "5",
            "reviewer": "Nicholas Souza"
        },
        {
            "title": "Knee Surgery",
            "body": "I had knee surgery two weeks ago. I started using 27:17 as soon as I got my bandages off, and my recovery sped up like I couldn’t have imagined. I am a former D1 athlete, and have had a dozen surgeries since my career ended. This is the first time using 27:17, and it has made a significant difference.",
            "rating": "5",
            "reviewer": "Byron Campbell"
        },
        {
            "title": "Love the product..",
            "body": "A year ago I had rotator cuff surgery on both shoulders. Its been a hard and painful recover I’ve tried all kinds of topicals but since using 27:17 I’ve notice less pain and a noticeable increase in my range of motion. At 58 yrs olds  my knees would always hurt after leg day workouts. Since using 27:17 I’ve noticed no pain and more gains. Just hit a deadlift PR of 455@3reps. I love this product.",
            "rating": "5",
            "reviewer": "Nick Hironaka"
        },
        {
            "title": "Nice addition to nightly routine",
            "body": "Added this to my nightly routine and pleasantly surprised. Passing 50 years old, aches and pains settle in at the end of the day after a heavy lift and a day of wearing steel toed boots. Rubbing this into my shoulders, knees, ankles, and toes has been a nice addition helping settling into sleep reduce my discomfort and adding a nice subtle scent. Still evaluating the long term effects, but encouraged from the start after searching for relief besides competitors like the awful smelling Bengay, so thank you 27:17!",
            "rating": "5",
            "reviewer": "Bradford P Crain"
        },
        {
            "title": "Absolutely pointless!",
            "body": "Used this twice on a sore should after a wakeboard competition. There was no difference or pain relief. I honestly held two of the people in high regards that you use to promote this product, now I have lost some faith in them. I wish yall did a money back guarantee.",
            "rating": "1",
            "reviewer": "Mark Riley"
        },
        {
            "title": "",
            "body": "Great product! First recovery cream I have tried that has actually provided relief and quick healing/recovery to muscles and joints.",
            "rating": "5",
            "reviewer": "Timothy Liberto"
        },
        {
            "title": "",
            "body": "It works, get it!",
            "rating": "5",
            "reviewer": "Mark A. Tosoc"
        },
        {
            "title": "27:17 IS LEGIT",
            "body": "First of you’re guys recovery cream os the first stuff I’ve used that actually helps you recover and doesn’t just heat your skin up in the problem area. I’m a commercial electrician and avid BJJ practitioner and use 27:17 on the daily. Recently I got my 62 year old Dad on the recovery cream as well because he rolls BJJ 4-5 times a week and he’s now hooked and we’re spreading the word around our Gracie Academy! I’d be amped on any extra coupons or merch because I’ll continue to support. Great Verse to name a company after too…Proverbs 27:17!",
            "rating": "5",
            "reviewer": "Jared Rangel"
        },
        {
            "title": "",
            "body": "Awesome, had a problem with my shoulder from rolling and I put in on after a session and woke up with no pain at all.",
            "rating": "5",
            "reviewer": "Chad Lowery"
        },
        {
            "title": "Outstanding",
            "body": "Been using it as I rehab after shoulder surgery. Stuff works better than any other topical I've tried. And I've tried em all.",
            "rating": "5",
            "reviewer": "David Evans"
        },
        {
            "title": "Good stuff!",
            "body": "Myself and my Hunny have been using it. I use it on my back and she uses it on her knees. No complaints so far, thanks for checking in. The only question I would ask is how much is to much? I’m using it once a day, she uses it twice a day. 👍🏻",
            "rating": "5",
            "reviewer": "Jim Sullivan"
        },
        {
            "title": "Didn't notice",
            "body": "Didn't notice any effects from the cream.",
            "rating": "1",
            "reviewer": "William Olivares"
        },
        {
            "title": "Review",
            "body": "The high-end packaging sets the expectation for this product.  It smells great, especially compared to the other pain relief rubs.  The actual pain relief…..well, it’s okay.  I was hoping for more relief, but it’s basically arnica-style relief.  Perhaps I’ll mix this with DMSO in the future.",
            "rating": "3",
            "reviewer": "James Mead"
        },
        {
            "title": "Great Product",
            "body": "Definitely helped my knee as I am recovering from a knee injury. Smells great too.",
            "rating": "5",
            "reviewer": "Brendan Shields"
        },
        {
            "title": "Best Cream Ever",
            "body": "I am a wrestling coach at the HS level. I spend alot of time banged up. Recently I had a sidelined shoulder injury that I couldn't get over. After three days of using this cream, I gained strength and full range of motion in my arm. The soreness is still there a little, but absolutely 100% noticeable different. I would love to partner with you guys!",
            "rating": "5",
            "reviewer": "Casper Petty"
        },
        {
            "title": "Didn’t help",
            "body": "I used this for tennis elbow hoping it would provide some relief. It did not. Not even a little.",
            "rating": "2",
            "reviewer": "Mike Sewell"
        },
        {
            "title": "LEGIT!",
            "body": "The stuff just works! Im an old(er) Army vet with a lot of pains from doing dumb shit. This stuff eases those pains so I can still lift and play with my kids! Buy the stuff, get the stuff, use the stuff!",
            "rating": "5",
            "reviewer": "Jeff French"
        },
        {
            "title": "Was skeptical",
            "body": "I always thought “don’t fall for it”, “it’s just good marketing”. But I have a PT test for a new rank coming up, and injured myself preparing for it. I thought, “the worst that can happen is it doesn’t work, I’m already not healing”. This obviously didn’t “heal” my injury. But man did it help with the pain after training, and help with recovery to help me push through my testing. This works, I believe.",
            "rating": "5",
            "reviewer": "Robert Holmes"
        },
        {
            "title": "Constant aches and pain",
            "body": "Came off a long weekend with multiple prolonged injuries from 36 holes a day. The theragun wasn’t doing it anymore so I bought this off an Instagram ad and within two days no more knee pain and the issues with my Achilles were done and gone",
            "rating": "5",
            "reviewer": "Blaine Thibodeau"
        },
        {
            "title": "Awesome Product",
            "body": "I was skeptical about if this would work or not, and it did not disappoint. My knee was bothering me for about 6 weeks before trying this product and after using it for about a week, my knee feels 100% better. Definitely ordering more of this!",
            "rating": "5",
            "reviewer": "James Haynes"
        },
        {
            "title": "",
            "body": "I was skeptical if this would work or not and it did not disappoint…my knee was bothering me for about 6 weeks before I bought this product and after about one week of using it, my knee feels 100% better. I’ll definitely be ordering more for sure.",
            "rating": "5",
            "reviewer": "James Haynes"
        },
        {
            "title": "Better than bpc 157/tb500",
            "body": "I bought this because of bjj pain after class. Tried bpc 157/tb500 for relief and I didn't get the relief everyone got. Tried 2717 on my shoulder and damn, took the edge off. I'm 51, easy beyond my prime but I love combat sports. 2717 is the way.",
            "rating": "5",
            "reviewer": "Mark A. Tosoc"
        },
        {
            "title": "",
            "body": "Love this product so far. Will more than likely continue to buy",
            "rating": "5",
            "reviewer": "Zack Mendenhall"
        },
        {
            "title": "Can’t believe how well it works!",
            "body": "Only been using it for a week or so and that lingering twinge of quad tendinitis in my knee has completely gone. Top stuff this!",
            "rating": "5",
            "reviewer": "Jack Atherton"
        },
        {
            "title": "First time user",
            "body": "The cream did work as promised...easy to apply and great packaging!  Would like to know if there is a limit on how many times it could be applied daily or how much each time.  Also, is it okay to use it for long periods of time without side effects.",
            "rating": "5",
            "reviewer": "Robert Panah"
        },
        {
            "title": "Game Changing",
            "body": "I was skeptical due to the lack of information on the product and price. However, after a month of use I can attest the product is amazing. Shoulder pain has subsided, soreness and residual recover pain is gone and to top it off the smell of the product is pleasant. Buy without hesitation.",
            "rating": "5",
            "reviewer": "Richard Johnson"
        },
        {
            "title": "Smells good. Didn't help pulled muscle, might work on soreness",
            "body": "I hurt my lower back training bjj a few weeks back and came across an interview Bo did with Jocko promoting his new product. I like Bo and Jocko quite a bit so I figured I'd take their word for it. While it smells good, I haven't noticed any physical benefit from using it over the last two weeks. Then again, I've never found a cream that actually does work; this one just happens to be 5x the price of Icy Hot with the same results. Because Bo will one day be UFC champ, and I really wanted this to work, I figured I'd give him the benefit of the doubt and science it a bit. So, I tried it on sore muscles assuming the back injury was too harsh for essential oils. It seemed to provide very mild relief from general training-related soreness, which I appreciated.",
            "rating": "2",
            "reviewer": "David Miller"
        },
        {
            "title": "10",
            "body": "Super amazing wow OmG",
            "rating": "5",
            "reviewer": "Vernon Shelton"
        },
        {
            "title": "",
            "body": "Best stuff in the game!",
            "rating": "5",
            "reviewer": "Jeff French"
        },
        {
            "title": "Awesome stuff",
            "body": "This has made a big difference in my shoulder. I have some swelling and impingement. It was aggravated enough that the pain would wake me up every night. Using the recovery cream before bed and I have no issues. Great stuff worth the money.",
            "rating": "5",
            "reviewer": "David Wiles"
        },
        {
            "title": "Recovery Cream",
            "body": "Been using for about a week after my workouts.  I have seen a nice improvement in my recovery and reduction in joint swelling.",
            "rating": "5",
            "reviewer": "michael robleno"
        },
        {
            "title": "Pain relief",
            "body": "I have been in Law Enforcement for over twenty years and I have lived off Tylenol, Ibuprofen and Bio-Freeze . This is the first the first stuff that lasts. I am sold",
            "rating": "5",
            "reviewer": "Tony DeFrancesco"
        },
        {
            "title": "",
            "body": "Great smell, sore muscles already starting to mend. Fantastic customer service and customer outreach!",
            "rating": "5",
            "reviewer": "Eric Ledford"
        },
        {
            "title": "",
            "body": "Doesn’t have the efficacy that it claims. Have used it daily for my golfers elbow, and quite frankly feel no resolve. I will not purchase again nor recommend to any gym personnel.",
            "rating": "1",
            "reviewer": "Eric Irwin"
        },
        {
            "title": "Great stuff",
            "body": "My only issue is you can’t tell when you’re a going to be empty . Maybe add a way of indicating the bottle will be empty soon .other than that it might be helpful to state how much you need to use with each application. These issues are very minor and don’t change what a great product you have",
            "rating": "5",
            "reviewer": "Patrick Fitzmaurice"
        },
        {
            "title": "",
            "body": "LOVE IT",
            "rating": "5",
            "reviewer": "Bobby Andrade"
        },
        {
            "title": "Great for after the gym",
            "body": "I just got back into the gym and with that comes DOMS. I was SORE and looking for relief. I will be repurchasing this product when I run out, no doubt about it. It smells good and causes a nice sensation. I feel like it helped with my soreness and aches. It was nice to put on at night after a hard workout and a hot shower, really upped the relaxation factor. I like the consistency on it, its not greasy or super cooling or super hot. It feels high end and I like the results I am getting from it.",
            "rating": "5",
            "reviewer": "Brittany Howard"
        },
        {
            "title": "Go Train!",
            "body": "To be honest, I was skeptical about this product. Right about the time I Popped my LCL rolling, Bo Nickal started showing up in my timeline. I needed to get back on the mat so I thought, what the hell! I ordered a bottle and have been using it religiously since. It’s been 2 weeks since my LCL injury and I’m damn near 100%. I would be being lying,  if I said 27:17 didn’t aid in the process. Definitely a repeat customer!",
            "rating": "5",
            "reviewer": "Thomas Brook"
        },
        {
            "title": "Good stuff",
            "body": "When I put 27:17 on, I feel relief for aches almost immediately, wherever I put it I feel tension releasing and a relaxed sent",
            "rating": "5",
            "reviewer": "Sergio Zaragoza"
        },
        {
            "title": "Neutral",
            "body": "Feels like it helps with swelling(idk I’m not a doctor) early indications are impressive… TBD on long term effects! So far so good!",
            "rating": "4",
            "reviewer": "Bradley Beeman"
        },
        {
            "title": "Outstanding product",
            "body": "27:17 really helps make the typical brushing and sore spots from rolling lessen almost immediately.  Great stuff, highly recommend",
            "rating": "5",
            "reviewer": "Fred Ossanna"
        },
        {
            "title": "You need this",
            "body": "I ordered this off a whim. It feels great not greasy and smells great. The day it showed up. I happen to have a issue with my IT band down by my knee. I’ve been using that icing it and stretching and getting better but I think 2717 has a big deal to do with that.",
            "rating": "5",
            "reviewer": "Kenneth Nienhaus"
        },
        {
            "title": "",
            "body": "Love the cooling feeling it delivers!",
            "rating": "5",
            "reviewer": "Christopher C Ryan"
        },
        {
            "title": "Amazing",
            "body": "I bought on a whim after a shoulder injury at BJJ.  This stuff is incredible! I'm not surenhownit works, but I will continue to buy it!",
            "rating": "5",
            "reviewer": "Kelly Newcomer"
        },
        {
            "title": "27:17",
            "body": "I enjoy the product but the pump is sub standard. Upgrade the pump mechanism or change the container.",
            "rating": "4",
            "reviewer": "James Scott"
        },
        {
            "title": "Awesome product",
            "body": "Early review is this stuff is amazing. Shoulder pain almost completely gone. Great package. Easy application. Nice smell not greasy",
            "rating": "5",
            "reviewer": "Jim Thompson"
        },
        {
            "title": "Works great",
            "body": "27:17 has helped heal skin on my arms in 1/2 the time. As a retired firefighter I have a lot of skin issues from burns on my arms and hands. This product has allowed me to heal quicker. I am hoping with continued use I may not get as many skin tears.",
            "rating": "5",
            "reviewer": "Dennis Andrews"
        },
        {
            "title": "Basically Wolverine Lotion",
            "body": "Exactly what you'd think minus the mutton chops and knife knuckles",
            "rating": "5",
            "reviewer": "Daniel Yonemoto"
        },
        {
            "title": "Good…packaging",
            "body": "This product does smell really nice and may even be working on my knee joint as I train wisely as a bjj teacher. I will say though, Shipping took a little while and I was a little disappointed however the product came very well branded and  packaged for the company. I appreciate that as a small business owner but it may keep people from returning due to the slight ship delay. My $.02",
            "rating": "5",
            "reviewer": "Ron Manes"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Jeff Antcliff"
        },
        {
            "title": "",
            "body": "Great product, everyone in the family thinks it’s excellent!",
            "rating": "5",
            "reviewer": "Bruce Cameron"
        },
        {
            "title": "Best topical recovery cream I’ve used",
            "body": "This stuff keeps my knees and hips feeling good from multiple heavy sessions each week.",
            "rating": "5",
            "reviewer": "Michael Krushinsky"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Brent Fisher"
        },
        {
            "title": "Newbie",
            "body": "So far I’ve been using the cream before rolling and there’s a difference. I have knee injuries and hopefully this will my road to recovery",
            "rating": "5",
            "reviewer": "Ray Bangit"
        },
        {
            "title": "Nice, pleasant cream",
            "body": "I am using this on a chronic back injury as well as an elbow with tendonitis. I have not noticed a dramatic improvement over the last 2 weeks that I've been using the product. It does feel good when I apply the cream and there might be a slight improvement when I apply it. I am hoping for long term improvement and so far I unfortunately cannot report that result. I plan to continue to treat my problem areas and hope for more tangible results with additional time.",
            "rating": "4",
            "reviewer": "Russell Bachman"
        },
        {
            "title": "RIDICULOUS!!!",
            "body": "Guys…. I’m BLOWN away. I had confidence in this when I ordered it because I trusted what I had heard about it and was really impressed with the vision of the company.I’m an older , banged up veteran who just started training Jiu Jitsu 2 years ago.  Needless to say I get my share of annoying little injuries training and keeping up with the young guys.  I’m 4 weeks into using this stuff and I’m blown away. It’s RIDICULOUS how good it works.  It’s not just a cream that “covers up” the injury for a little while. It’s helping the HEALING of it. And FAST!Guys, I LOVE LOVE LOVE IT and I tell EVERYONE about it.You’ve really cracked the code. Phenomenal job. Thank you so much for this and thanks for all of your hard work. Customer for life! Praying for your continued success and your vision with this product.",
            "rating": "5",
            "reviewer": "roy vix"
        },
        {
            "title": "GOOD!",
            "body": "Love it",
            "rating": "4",
            "reviewer": "Alex True"
        },
        {
            "title": "Seems to work",
            "body": "It does seem to help with pain which is probably due to the arnica? I’ve used it on my knee and wrists, I’m 47 and not as young as I used to be. I did experience relief from discomfort. Skin can only really absorb so much of the stuff as it is kinda a massage-ish oil also. It does smell pretty good.",
            "rating": "4",
            "reviewer": "Bruce Brinker"
        },
        {
            "title": "Great product",
            "body": "Product works GREAT.  However the  bottle dispenser/ plunger did not work.",
            "rating": "5",
            "reviewer": "Andrew Groat"
        },
        {
            "title": "Great for BJJ",
            "body": "I use this after a night of rolling on the mats, it definitely helps with the soreness and recovery. It also has a nice smell which is way better than the chemical smell of other creams.",
            "rating": "5",
            "reviewer": "Connor Martin"
        },
        {
            "title": "Legit",
            "body": "I really like this stuff, it definitely helps provide relief and recovery for an injury I have in my right arm.  I wish it was cheaper, but worth the price and will buy again.",
            "rating": "5",
            "reviewer": "Randy Hansen"
        },
        {
            "title": "27:17",
            "body": "This product has worked for my rehabilitation for a torn patella tendon.  My recovery time and knee has been on the fast track to get me back on the football field.",
            "rating": "5",
            "reviewer": "Kelly Rice"
        },
        {
            "title": "3yr knee pain",
            "body": "As a physical therapist who wanted to keep training, my plica syndrome knee pain never fully healed over last 3 years with small set backs here and there. With daily applications of 27:17 over the last 3weeks and continued knee specific strength and stretching exercises along with heat and ice, my pain has reduced 80% with no set backs during training. Great complementary tool for soft tissue healing!",
            "rating": "5",
            "reviewer": "Rick Minniear"
        },
        {
            "title": "",
            "body": "Relief & Recovery Cream",
            "rating": "5",
            "reviewer": "Weston Straight"
        },
        {
            "title": "Disappointed ☹️",
            "body": "I really wanted to like this stuff! However, upon using it on multiple sore areas of my body (elbow, knee, calf) I did not feel any relief.",
            "rating": "1",
            "reviewer": "Anonymous"
        },
        {
            "title": "27:17 Recovery",
            "body": "I bought this for my son to try out as the 23-24 wrestling season begins but we haven't been up to the college again yet. I have a knee that gives me trouble when it reaches new levels since I injured it in 1987 and decided to try it out. It definitely knocked the edge off in a short period of time and seemed to be relaxing throughout. I rubbed it in all the around my knee and elevated. Great stuff!! I can't wait to get it to my boys next week!! Thank you!!",
            "rating": "5",
            "reviewer": "William Critchfield"
        },
        {
            "title": "",
            "body": "Will definitely be getting more",
            "rating": "5",
            "reviewer": "Greg Ische"
        },
        {
            "title": "I love it",
            "body": "Recently hurt my knee and since using the cream it seems my recovery has sped up. Great product",
            "rating": "5",
            "reviewer": "Matt Parrado"
        },
        {
            "title": "Great fast working.",
            "body": "Would use again and again. Definitely recommend for fast acting pain relief.  I plan to use it as stocking stuffers for all my athlete kids.",
            "rating": "5",
            "reviewer": "Jolene Fielding"
        },
        {
            "title": "Murse pain",
            "body": "Working as a critical care nurse you are pushing and pulling weight all day. Sometimes even the horses get sore. Well I tried this product among other trials in the past. This product actually works. I will most likely continue 27:17 because it helped reduce a sore 45 y/o workhorse body.",
            "rating": "5",
            "reviewer": "Matthew Broderick"
        },
        {
            "title": "Game-Changer!",
            "body": "I use 27:17 on my right Achilles (micro-tears) - and it's benefited beyond my imagining. It's almost like magic. I also use it before lifting as a \"warm-up\"; this cream has that much versatility! I have bought it for my dad, my mother-in-law, my son, and my step-daughter - each one of them swear by it now! One of the best products I have ever used. Incredible!",
            "rating": "5",
            "reviewer": "FRANK MURPHY"
        },
        {
            "title": "Dupuytrens",
            "body": "I have Dupuytrens in my hands and it’s very painful. When I try and stretch my fingers out, it comes with major discomfort. I’ve been using 2717 recovery for the last week and it is allowed my hands to stretch out with minimal pain and discomfort. I love playing golf and this is helped me grip the club with comfort again it may not fix my Dupuytrens, but has allowed me to use my hands as I’m accustomed to ? This is the only product that has made a difference in the way my hands feel.  No more pain…",
            "rating": "5",
            "reviewer": "DAVID A GITLITZ"
        },
        {
            "title": "Product review",
            "body": "Works great. A knee gets stiff every now and then but 27:17 takes care of it and it is just like new.",
            "rating": "5",
            "reviewer": "William Grubb"
        },
        {
            "title": "It's Legit",
            "body": "I picked up the 27:17 product to see if it would help my recovery and aches from training powerlifting movements. And so far so good. I've had noticeable improvements,  specifically with my shoulders. I have used it daily for the past couple of weeks and look forward to its long-term effectiveness.",
            "rating": "5",
            "reviewer": "Erich Sagers"
        },
        {
            "title": "",
            "body": "Great stuff!",
            "rating": "5",
            "reviewer": "Mitchell Brown"
        },
        {
            "title": "Amazing",
            "body": "Overnight takes away pain and inflammation.",
            "rating": "5",
            "reviewer": "David Kinsella"
        },
        {
            "title": "Fkn Amazing!",
            "body": "After a major knee surgery my knee hurt all the time, the bakers cyst was huge causing extra pain. After a week of using this my bakers cyst is almost gone along with the tightness and pain in my knee. It works so well I bought my mom amd daughter some.",
            "rating": "5",
            "reviewer": "Ariane Duncan"
        },
        {
            "title": "FIRE",
            "body": "27/17....it's Biblical",
            "rating": "5",
            "reviewer": "Mark Rusnak"
        },
        {
            "title": "",
            "body": "Highly recommend. I have wrestlers and MMA in my house.",
            "rating": "5",
            "reviewer": "Jolene Fielding"
        }
    ]
}